[{"data":1,"prerenderedAt":503},["Reactive",2],{"content-query-LjPlv9Sq1J":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":5,"title":7,"description":8,"body":9,"_type":498,"_id":499,"_source":500,"_file":501,"_extension":502},"/privacy-policy","",false,"Privacy Policy","Effective Date: This Privacy Policy is effective as of February 16, 2024.",{"type":10,"children":11,"toc":481},"root",[12,31,36,43,48,60,71,82,93,104,115,126,131,137,142,149,164,170,188,194,222,227,233,238,267,272,278,283,311,317,322,327,343,356,361,367,372,377,382,387,392,398,403,438,443,449,454,459,464,470],{"type":13,"tag":14,"props":15,"children":16},"element","p",{},[17,24,26],{"type":13,"tag":18,"props":19,"children":20},"strong",{},[21],{"type":22,"value":23},"text","Effective Date",{"type":22,"value":25},": ",{"type":13,"tag":18,"props":27,"children":28},{},[29],{"type":22,"value":30},"This Privacy Policy is effective as of February 16, 2024.",{"type":13,"tag":14,"props":32,"children":33},{},[34],{"type":22,"value":35},"Welcome to the Privacy Policy of QAComet (\"we,\" \"us,\" or \"our\"). This Privacy Policy outlines how we collect, use, share, and protect information obtained from visitors (\"users\" or \"you\") of the QAComet website. We are committed to safeguarding your privacy and ensuring the security of your personal information. By accessing or using the QAComet website, you acknowledge that you have read, understood, and agree to the practices described in this Privacy Policy. If you do not agree with this Privacy Policy, please refrain from using our website. This Privacy Policy applies solely to information collected by QAComet and does not apply to information collected by any third-party websites or services that may be linked to or from our website. We encourage you to review the privacy policies of those third-party websites or services before providing any personal information.",{"type":13,"tag":37,"props":38,"children":40},"h2",{"id":39},"definitions",[41],{"type":22,"value":42},"DEFINITIONS:",{"type":13,"tag":14,"props":44,"children":45},{},[46],{"type":22,"value":47},"In this Privacy Policy, unless the context otherwise requires:",{"type":13,"tag":14,"props":49,"children":50},{},[51,53,58],{"type":22,"value":52},"\"",{"type":13,"tag":18,"props":54,"children":55},{},[56],{"type":22,"value":57},"QAComet",{"type":22,"value":59},"\" refers to the website operated by QAComet LLC accessible at QAComet.com",{"type":13,"tag":14,"props":61,"children":62},{},[63,64,69],{"type":22,"value":52},{"type":13,"tag":18,"props":65,"children":66},{},[67],{"type":22,"value":68},"Personal Information",{"type":22,"value":70},"\" refers to any information that can be used to identify or contact an individual, such as name, email address, postal address, phone number, or any other information voluntarily provided by the user.",{"type":13,"tag":14,"props":72,"children":73},{},[74,75,80],{"type":22,"value":52},{"type":13,"tag":18,"props":76,"children":77},{},[78],{"type":22,"value":79},"Non-Personal Information",{"type":22,"value":81},"\" refers to data that does not directly identify an individual, including browser type, IP address, device type, operating system, and browsing behavior.",{"type":13,"tag":14,"props":83,"children":84},{},[85,86,91],{"type":22,"value":52},{"type":13,"tag":18,"props":87,"children":88},{},[89],{"type":22,"value":90},"Cookies",{"type":22,"value":92},"\" are small text files stored on a user's device when visiting a website, used to track and analyze website usage and personalize content.",{"type":13,"tag":14,"props":94,"children":95},{},[96,97,102],{"type":22,"value":52},{"type":13,"tag":18,"props":98,"children":99},{},[100],{"type":22,"value":101},"Google Analytics",{"type":22,"value":103},"\" is a web analytics service provided by Google LLC (\"Google\"), used to collect and analyze data about website usage, including IP addresses, browser types, operating systems, and pages visited.",{"type":13,"tag":14,"props":105,"children":106},{},[107,108,113],{"type":22,"value":52},{"type":13,"tag":18,"props":109,"children":110},{},[111],{"type":22,"value":112},"User",{"type":22,"value":114},"\" refers to any individual who accesses or uses the QAComet website.",{"type":13,"tag":14,"props":116,"children":117},{},[118,119,124],{"type":22,"value":52},{"type":13,"tag":18,"props":120,"children":121},{},[122],{"type":22,"value":123},"Owner",{"type":22,"value":125},"\" refers to QAComet LLC, the entity or individual responsible for the operation and management of the QAComet website.",{"type":13,"tag":14,"props":127,"children":128},{},[129],{"type":22,"value":130},"By accessing or using the QAComet website, you acknowledge and agree to the terms outlined in this Privacy Policy and the definitions provided herein.",{"type":13,"tag":37,"props":132,"children":134},{"id":133},"_1-information-collection",[135],{"type":22,"value":136},"1. INFORMATION COLLECTION:",{"type":13,"tag":14,"props":138,"children":139},{},[140],{"type":22,"value":141},"We collect two types of information from users: personal information and non-personal information.",{"type":13,"tag":143,"props":144,"children":146},"h3",{"id":145},"personal-information",[147],{"type":22,"value":148},"Personal Information:",{"type":13,"tag":150,"props":151,"children":152},"ul",{},[153,159],{"type":13,"tag":154,"props":155,"children":156},"li",{},[157],{"type":22,"value":158},"Personal information is data that can be used to identify or contact an individual. This may include, but is not limited to, your name, email address, postal address, phone number, or any other information you voluntarily provide to us through forms on the QAComet website.",{"type":13,"tag":154,"props":160,"children":161},{},[162],{"type":22,"value":163},"We collect personal information only if you voluntarily submit it to us, such as when you sign up for our newsletter, register for an account, or contact us through the website.",{"type":13,"tag":143,"props":165,"children":167},{"id":166},"non-personal-information",[168],{"type":22,"value":169},"Non-Personal Information:",{"type":13,"tag":150,"props":171,"children":172},{},[173,178,183],{"type":13,"tag":154,"props":174,"children":175},{},[176],{"type":22,"value":177},"Non-personal information is data that does not directly identify you as an individual. This may include, but is not limited to, your browser type, IP address, device type, operating system, and browsing behavior.",{"type":13,"tag":154,"props":179,"children":180},{},[181],{"type":22,"value":182},"We also use cookies and similar tracking technologies to collect non-personal information about your interactions with the QAComet website. Cookies are small text files that are stored on your device when you visit a website, and they help us analyze website traffic, customize content, and improve your user experience.",{"type":13,"tag":154,"props":184,"children":185},{},[186],{"type":22,"value":187},"We may also use third-party services, such as Google Analytics, to collect and analyze non-personal information about website usage. These services may use cookies and other tracking technologies to gather data about your activities on the QAComet website. Please refer to the \"Google Analytics\" section of this Privacy Policy for more information.",{"type":13,"tag":143,"props":189,"children":191},{"id":190},"google-analytics",[192],{"type":22,"value":193},"Google Analytics:",{"type":13,"tag":150,"props":195,"children":196},{},[197,202,207,212,217],{"type":13,"tag":154,"props":198,"children":199},{},[200],{"type":22,"value":201},"We use Google Analytics, a web analytics service provided by Google LLC (\"Google\"), to collect and analyze information about how users interact with the QAComet website.",{"type":13,"tag":154,"props":203,"children":204},{},[205],{"type":22,"value":206},"Google Analytics uses cookies to collect data about your interactions with the website, including your IP address, browser type, operating system, referral sources, and pages visited.",{"type":13,"tag":154,"props":208,"children":209},{},[210],{"type":22,"value":211},"This information is transmitted to and stored by Google on servers in the United States. Google uses this information to evaluate your use of the website, compile reports on website activity for website operators, and provide other services related to website activity and internet usage.",{"type":13,"tag":154,"props":213,"children":214},{},[215],{"type":22,"value":216},"Google may also transfer this information to third parties where required to do so by law, or where such third parties process the information on Google's behalf. Google will not associate your IP address with any other data held by Google.",{"type":13,"tag":154,"props":218,"children":219},{},[220],{"type":22,"value":221},"By using the QAComet website, you consent to the processing of data about you by Google in the manner and for the purposes set out above. For more information about Google's privacy practices and how Google uses data collected through Google Analytics, please see Google's Privacy Policy.",{"type":13,"tag":14,"props":223,"children":224},{},[225],{"type":22,"value":226},"We use the information collected from users to provide, maintain, and improve the QAComet website, as well as to communicate with users, personalize content, and analyze website traffic and usage patterns. We do not sell, trade, or rent personal information to third parties without your consent.",{"type":13,"tag":37,"props":228,"children":230},{"id":229},"_2-use-of-information",[231],{"type":22,"value":232},"2. USE OF INFORMATION:",{"type":13,"tag":14,"props":234,"children":235},{},[236],{"type":22,"value":237},"We use the information collected from users for the following purposes:",{"type":13,"tag":239,"props":240,"children":241},"ol",{},[242,247,252,257,262],{"type":13,"tag":154,"props":243,"children":244},{},[245],{"type":22,"value":246},"To Provide and Improve Services: We may use both personal and non-personal information to provide, maintain, and improve the QAComet website, including monitoring and analyzing website usage, identifying trends, and troubleshooting technical issues.",{"type":13,"tag":154,"props":248,"children":249},{},[250],{"type":22,"value":251},"To Communicate with Users: We may use personal information to communicate with users, respond to inquiries, provide customer support, and send administrative or transactional messages related to user accounts or services.",{"type":13,"tag":154,"props":253,"children":254},{},[255],{"type":22,"value":256},"To Personalize Content: We may use non-personal information, such as browsing behavior and preferences, to personalize content and recommendations on the QAComet website.",{"type":13,"tag":154,"props":258,"children":259},{},[260],{"type":22,"value":261},"To Analyze Website Traffic: We may use cookies and similar technologies, including Google Analytics, to analyze website traffic and usage patterns, track user interactions with the website, and compile statistical reports on website activity.",{"type":13,"tag":154,"props":263,"children":264},{},[265],{"type":22,"value":266},"For Marketing and Advertising: With user consent, we may use personal information to send promotional materials, newsletters, or other marketing communications. We may also use cookies and similar technologies to deliver targeted advertisements based on user interests and preferences.",{"type":13,"tag":14,"props":268,"children":269},{},[270],{"type":22,"value":271},"For Legal Compliance: We may use and disclose information as necessary to comply with legal obligations, enforce our policies, protect our rights or property, or respond to lawful requests from government authorities or law enforcement agencies.",{"type":13,"tag":37,"props":273,"children":275},{"id":274},"_3-sharing-of-information",[276],{"type":22,"value":277},"3. SHARING OF INFORMATION:",{"type":13,"tag":14,"props":279,"children":280},{},[281],{"type":22,"value":282},"We may share both personal and non-personal information collected from users in the following circumstances:",{"type":13,"tag":239,"props":284,"children":285},{},[286,291,296,301,306],{"type":13,"tag":154,"props":287,"children":288},{},[289],{"type":22,"value":290},"Third-Party Service Providers: We may engage trusted third-party service providers to assist us in operating the QAComet website or providing services on our behalf. These service providers may have access to user information as necessary to perform their functions, but they are prohibited from using it for any other purpose.",{"type":13,"tag":154,"props":292,"children":293},{},[294],{"type":22,"value":295},"Legal Compliance: We may disclose user information if required to do so by law or in response to valid legal requests, such as subpoenas, court orders, or other legal processes. We may also share information to protect our rights, property, or safety, or the rights, property, or safety of others.",{"type":13,"tag":154,"props":297,"children":298},{},[299],{"type":22,"value":300},"Business Transfers: In the event of a merger, acquisition, reorganization, or sale of assets, user information may be transferred or disclosed as part of the transaction. Any such transfer will be subject to appropriate confidentiality and security measures to protect user privacy.",{"type":13,"tag":154,"props":302,"children":303},{},[304],{"type":22,"value":305},"Consent: We may share user information with third parties if we have obtained user consent to do so. For example, we may share information with third-party partners for marketing purposes if users have opted in to such communications.",{"type":13,"tag":154,"props":307,"children":308},{},[309],{"type":22,"value":310},"Aggregated or Anonymized Data: We may share aggregated or anonymized data derived from user information for analytical purposes or to improve our services. This data does not identify individual users and cannot be used to personally identify anyone.",{"type":13,"tag":37,"props":312,"children":314},{"id":313},"_4-google-analytics",[315],{"type":22,"value":316},"4. GOOGLE ANALYTICS:",{"type":13,"tag":14,"props":318,"children":319},{},[320],{"type":22,"value":321},"We utilize Google Analytics, a web analytics service provided by Google LLC (\"Google\"), to collect and analyze data about user interactions with the QAComet website. Google Analytics uses cookies to gather information such as users' IP addresses, browser types, operating systems, referral sources, and pages visited. This information is transmitted to and stored by Google on servers in the United States.",{"type":13,"tag":14,"props":323,"children":324},{},[325],{"type":22,"value":326},"Google Analytics helps us understand how users engage with the website, allowing us to improve our services, optimize website performance, and enhance user experience.",{"type":13,"tag":14,"props":328,"children":329},{},[330,332,341],{"type":22,"value":331},"By using the QAComet website, you consent to the processing of data about you by Google in the manner and for the purposes outlined above. You can opt out of Google Analytics tracking by installing the Google Analytics Opt-out Browser Add-on, available at the following URL: ",{"type":13,"tag":333,"props":334,"children":338},"a",{"href":335,"rel":336},"https://tools.google.com/dlpage/gaoptout",[337],"nofollow",[339],{"type":22,"value":340},"Google Analytics Opt-out Browser Add-on",{"type":22,"value":342},".",{"type":13,"tag":14,"props":344,"children":345},{},[346,348,355],{"type":22,"value":347},"For more information about Google's privacy practices and how Google uses data collected through Google Analytics, please refer to Google's Privacy Policy: ",{"type":13,"tag":333,"props":349,"children":352},{"href":350,"rel":351},"https://policies.google.com/privacy?hl=en-US",[337],[353],{"type":22,"value":354},"Google Privacy Policy",{"type":22,"value":342},{"type":13,"tag":14,"props":357,"children":358},{},[359],{"type":22,"value":360},"Please note that opting out of Google Analytics tracking will not prevent your data from being collected by other analytics services or cookies used on the QAComet website.",{"type":13,"tag":37,"props":362,"children":364},{"id":363},"_5-data-security",[365],{"type":22,"value":366},"5. DATA SECURITY:",{"type":13,"tag":14,"props":368,"children":369},{},[370],{"type":22,"value":371},"We are committed to protecting the security of user information and have implemented reasonable measures to safeguard personal and non-personal data collected through the QAComet website. We employ physical, technical, and administrative safeguards to prevent unauthorized access, disclosure, alteration, or destruction of user information.",{"type":13,"tag":14,"props":373,"children":374},{},[375],{"type":22,"value":376},"Access to user information is restricted to authorized personnel who have a legitimate need to access such information for the purposes outlined in this Privacy Policy. All employees, contractors, and third-party service providers with access to user information are required to adhere to strict confidentiality obligations and undergo training on data security and privacy practices.",{"type":13,"tag":14,"props":378,"children":379},{},[380],{"type":22,"value":381},"Despite our best efforts, no method of transmission over the internet or electronic storage is completely secure, and we cannot guarantee the absolute security of user information. Therefore, while we strive to protect user information, we cannot guarantee its security.",{"type":13,"tag":14,"props":383,"children":384},{},[385],{"type":22,"value":386},"In the event of a data breach or unauthorized access to user information, we will take appropriate steps to mitigate the impact of the incident, notify affected users as required by law, and cooperate with regulatory authorities as necessary.",{"type":13,"tag":14,"props":388,"children":389},{},[390],{"type":22,"value":391},"We recommend that users take precautions to protect their personal information, such as choosing strong passwords, keeping login credentials confidential, and avoiding sharing sensitive information through insecure channels.",{"type":13,"tag":37,"props":393,"children":395},{"id":394},"_6-user-controls",[396],{"type":22,"value":397},"6. USER CONTROLS:",{"type":13,"tag":14,"props":399,"children":400},{},[401],{"type":22,"value":402},"Users have certain controls and choices regarding the collection and use of their information on the QAComet website:",{"type":13,"tag":239,"props":404,"children":405},{},[406,411,416,428,433],{"type":13,"tag":154,"props":407,"children":408},{},[409],{"type":22,"value":410},"Cookie Preferences: Users can manage their cookie preferences and settings through their web browser. Most web browsers allow users to control cookies through settings or preferences, including accepting or rejecting cookies, deleting cookies, and disabling tracking technologies. However, please note that disabling cookies may affect the functionality of certain features on the QAComet website.",{"type":13,"tag":154,"props":412,"children":413},{},[414],{"type":22,"value":415},"Opt-Out of Personalized Advertising: Users can opt out of personalized advertising served by third-party ad networks and ad platforms by adjusting their ad preferences or settings. Many ad networks and platforms offer opt-out mechanisms or tools for users to opt out of targeted advertising based on their interests and browsing behavior.",{"type":13,"tag":154,"props":417,"children":418},{},[419,421,426],{"type":22,"value":420},"Google Analytics Opt-Out: Users can opt out of Google Analytics tracking by installing the Google Analytics Opt-out Browser Add-on, available at ",{"type":13,"tag":333,"props":422,"children":424},{"href":335,"rel":423},[337],[425],{"type":22,"value":340},{"type":22,"value":427},". This browser add-on allows users to prevent their data from being collected and used by Google Analytics.",{"type":13,"tag":154,"props":429,"children":430},{},[431],{"type":22,"value":432},"Communication Preferences: Users can manage their communication preferences and opt out of receiving promotional emails, newsletters, or other marketing communications from QAComet by following the unsubscribe instructions provided in such communications. Please note that even if you opt out of receiving marketing communications, we may still send you transactional or administrative messages related to your account or services.",{"type":13,"tag":154,"props":434,"children":435},{},[436],{"type":22,"value":437},"Account Settings: Registered users may have access to account settings or preferences where they can update, edit, or delete their account information, including personal information provided during registration.",{"type":13,"tag":14,"props":439,"children":440},{},[441],{"type":22,"value":442},"By exercising these user controls and preferences, users can better manage their privacy and make informed choices about how their information is collected, used, and shared on the QAComet website. We respect and honor user preferences regarding the handling of their information and strive to provide transparent and accessible mechanisms for users to exercise their rights.",{"type":13,"tag":37,"props":444,"children":446},{"id":445},"_7-changes-to-the-privacy-policy",[447],{"type":22,"value":448},"7. CHANGES TO THE PRIVACY POLICY:",{"type":13,"tag":14,"props":450,"children":451},{},[452],{"type":22,"value":453},"QAComet reserves the right to update or modify this Privacy Policy at any time without prior notice. Any changes to the Privacy Policy will be posted on this page with an updated \"Last Updated\" date at the top of the page. We encourage users to review this Privacy Policy periodically to stay informed about how we collect, use, and protect their information.",{"type":13,"tag":14,"props":455,"children":456},{},[457],{"type":22,"value":458},"By continuing to access or use the QAComet website after any changes to this Privacy Policy become effective, you acknowledge and agree to the updated terms. If you do not agree with the changes to the Privacy Policy, you must discontinue your use of the QAComet website.",{"type":13,"tag":14,"props":460,"children":461},{},[462],{"type":22,"value":463},"If we make material changes to this Privacy Policy that affect how we collect, use, or share user information, we may provide notice through the QAComet website, by email, or through other means prior to the changes taking effect. We may also obtain user consent for any material changes where required by applicable law.",{"type":13,"tag":37,"props":465,"children":467},{"id":466},"_8-contact-information",[468],{"type":22,"value":469},"8. CONTACT INFORMATION:",{"type":13,"tag":14,"props":471,"children":472},{},[473,475],{"type":22,"value":474},"If you have any questions, concerns, or inquiries about this Privacy Policy or the practices of QAComet regarding the collection, use, or disclosure of your information, please ",{"type":13,"tag":333,"props":476,"children":478},{"href":477},"mailto:contact@QAComet.com",[479],{"type":22,"value":480},"Contact Us",{"title":5,"searchDepth":482,"depth":482,"links":483},2,[484,485,491,492,493,494,495,496,497],{"id":39,"depth":482,"text":42},{"id":133,"depth":482,"text":136,"children":486},[487,489,490],{"id":145,"depth":488,"text":148},3,{"id":166,"depth":488,"text":169},{"id":190,"depth":488,"text":193},{"id":229,"depth":482,"text":232},{"id":274,"depth":482,"text":277},{"id":313,"depth":482,"text":316},{"id":363,"depth":482,"text":366},{"id":394,"depth":482,"text":397},{"id":445,"depth":482,"text":448},{"id":466,"depth":482,"text":469},"markdown","content:privacy-policy.md","content","privacy-policy.md","md",1713049943651]