[{"data":1,"prerenderedAt":335},["Reactive",2],{"blog-post-/case-studies/automatisch":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"subtitle":10,"breadcrumbs":11,"link":4,"created":16,"shortDescription":21,"body":22,"_type":330,"_id":331,"_source":332,"_file":333,"_extension":334},"/case-studies/automatisch","case-studies",false,"","Automatisch","W","Going from the launch pad to the cosmos with E2E testing",[12,15],{"name":13,"path":14},"Case Studies","/case-studies",{"name":8,"path":4},{"string":17,"month":18,"day":19,"year":20},"February 26, 2024","Feb",26,2024,"We've recently worked with Automatisch.io and provided numerous testing and QA services supporting their codebase.",{"type":23,"children":24,"toc":313},"root",[25,34,50,56,75,81,88,93,129,134,140,155,170,185,200,206,211,217,231,237,242,247,252,257,270,276,281,286,291,297,302,308],{"type":26,"tag":27,"props":28,"children":30},"element","h2",{"id":29},"improving-software-quality-and-testing-infrastructure-for-automatisch",[31],{"type":32,"value":33},"text","Improving Software Quality and Testing Infrastructure for Automatisch",{"type":26,"tag":35,"props":36,"children":37},"p",{},[38,40,48],{"type":32,"value":39},"We recently collaborated with an open source no-code automation company called ",{"type":26,"tag":41,"props":42,"children":46},"a",{"href":43,"rel":44},"https://automatisch.io",[45],"nofollow",[47],{"type":32,"value":8},{"type":32,"value":49}," and helped them both improve their product with our numerous QA services. This includes implementing automated tests, bug finding and reporting, and enhancing their continuous integration (CI) pipeline to support both community and enterprise editions.",{"type":26,"tag":27,"props":51,"children":53},{"id":52},"automatisch-the-open-source-zapier-alternative",[54],{"type":32,"value":55},"Automatisch: The Open Source Zapier Alternative",{"type":26,"tag":35,"props":57,"children":58},{},[59,64,66,73],{"type":26,"tag":41,"props":60,"children":62},{"href":43,"rel":61},[45],[63],{"type":32,"value":8},{"type":32,"value":65}," is a reputable ",{"type":26,"tag":41,"props":67,"children":70},{"href":68,"rel":69},"https://github.com/automatisch/automatisch",[45],[71],{"type":32,"value":72},"open source",{"type":32,"value":74}," software integration platform providing an alternative to Zapier. It is built with a variety of node JS libraries, including ReactJS and expressJS. Upon starting our collaboration, their product already had several dozen integrations with other platforms, and were in progress building many more. The key quality assurance (QA) requirements included discovering and documenting bugs, developing automated smoke tests using playwright, and ensuring the CI pipeline works flawlessly for both community and enterprise editions.",{"type":26,"tag":27,"props":76,"children":78},{"id":77},"proactive-bug-finding-and-reporting",[79],{"type":32,"value":80},"Proactive Bug Finding and Reporting",{"type":26,"tag":82,"props":83,"children":85},"h3",{"id":84},"our-approach-to-reporting-bugs",[86],{"type":32,"value":87},"Our approach to reporting bugs",{"type":26,"tag":35,"props":89,"children":90},{},[91],{"type":32,"value":92},"While working through our testing of Automatisch's platform, we discovered bugs covering a wide span of cases. All of our bug reports included three sections",{"type":26,"tag":94,"props":95,"children":96},"ul",{},[97,109,119],{"type":26,"tag":98,"props":99,"children":100},"li",{},[101,107],{"type":26,"tag":102,"props":103,"children":104},"strong",{},[105],{"type":32,"value":106},"Overview",{"type":32,"value":108},": A Quick overview of the bug found, which generally includes an image",{"type":26,"tag":98,"props":110,"children":111},{},[112,117],{"type":26,"tag":102,"props":113,"children":114},{},[115],{"type":32,"value":116},"Reproduction",{"type":32,"value":118},": Detailed list of instructions for reproducing the bug",{"type":26,"tag":98,"props":120,"children":121},{},[122,127],{"type":26,"tag":102,"props":123,"children":124},{},[125],{"type":32,"value":126},"Improvements",{"type":32,"value":128},": Suggestions for how to resolve the bug and improve the software",{"type":26,"tag":35,"props":130,"children":131},{},[132],{"type":32,"value":133},"Using this format makes it clear for future developers where they can find the source of the problem and resolve the ticket.",{"type":26,"tag":82,"props":135,"children":137},{"id":136},"some-bugs-we-found",[138],{"type":32,"value":139},"Some Bugs We Found",{"type":26,"tag":35,"props":141,"children":142},{},[143,153],{"type":26,"tag":102,"props":144,"children":145},{},[146],{"type":26,"tag":41,"props":147,"children":150},{"href":148,"rel":149},"https://github.com/automatisch/automatisch/issues/1371",[45],[151],{"type":32,"value":152},"Recreating deleted users",{"type":32,"value":154},": If an admin deleted a user they manage, and then attempted to re-create that user with the same email address, they were met with not only an opaque error message, but also did not have a way to recover the user's old account.",{"type":26,"tag":35,"props":156,"children":157},{},[158,168],{"type":26,"tag":102,"props":159,"children":160},{},[161],{"type":26,"tag":41,"props":162,"children":165},{"href":163,"rel":164},"https://github.com/automatisch/automatisch/issues/1370",[45],[166],{"type":32,"value":167},"Inconsistent interface conveying permissions",{"type":32,"value":169},": If a user does not have permissions to create a connection to a platform integrated into Automatisch, there was inconsistent behavior in the interface depending on the page they accessed. For example, the user could",{"type":26,"tag":35,"props":171,"children":172},{},[173,183],{"type":26,"tag":102,"props":174,"children":175},{},[176],{"type":26,"tag":41,"props":177,"children":180},{"href":178,"rel":179},"https://github.com/automatisch/automatisch/issues/1366",[45],[181],{"type":32,"value":182},"Deleting roles edge case",{"type":32,"value":184},": If a only a deleted user has a role attached to them, the admin is not able to delete the role after the user has been deleted.",{"type":26,"tag":35,"props":186,"children":187},{},[188,198],{"type":26,"tag":102,"props":189,"children":190},{},[191],{"type":26,"tag":41,"props":192,"children":195},{"href":193,"rel":194},"https://github.com/automatisch/automatisch/issues/1235",[45],[196],{"type":32,"value":197},"Invalidating GitHub OAuth error",{"type":32,"value":199},": If a user invalidates the oauth token used by Automatisch, there is not a useful error reported, only a generic error message which could imdicate many different problems.",{"type":26,"tag":27,"props":201,"children":203},{"id":202},"dive-into-testing",[204],{"type":32,"value":205},"Dive into Testing",{"type":26,"tag":35,"props":207,"children":208},{},[209],{"type":32,"value":210},"Upon starting out work with Automatisch, we dove into a codebase already containing tests for some of the features their SaaS provides. One of the first tasks we worked on was refactoring one of the main smoke tests into one which followed best practices in Playwright.",{"type":26,"tag":82,"props":212,"children":214},{"id":213},"refactoring-workflow-tests",[215],{"type":32,"value":216},"Refactoring Workflow Tests",{"type":26,"tag":35,"props":218,"children":219},{},[220,222,229],{"type":32,"value":221},"The central workflow configuration interface in Automatisch is their bread and butter: this is where users go to configure their custom integrations between the various supported platforms. The set of tests for this part of the codebase included some large multi-part test cases which needed to be run sequentially. We refactored this set of code using Playwright's ",{"type":26,"tag":223,"props":224,"children":226},"code",{"className":225},[],[227],{"type":32,"value":228},"test.step",{"type":32,"value":230}," interface, which makes it easy to write a large multipart test into smaller easily comprehendable test units. By refactoring we ensured the test ordering was guaranteed to be stable across platforms, ensuring replicability of test runs while also giving assurances for working featres across software releases.",{"type":26,"tag":82,"props":232,"children":234},{"id":233},"user-management",[235],{"type":32,"value":236},"User Management",{"type":26,"tag":35,"props":238,"children":239},{},[240],{"type":32,"value":241},"After this refactoring, we began work writing tests for other parts of the application. This included writing test cases for managing users for the enterprise-edition of Automatisch. Part of writing the tests is setting up the application code so it is compatible with the tests, even after user interface changes.",{"type":26,"tag":35,"props":243,"children":244},{},[245],{"type":32,"value":246},"Our tests for user management captured a wide number of workflows administrators could face while using Automatisch. This includes the basic user workflows, such as creating users from the administrators side, editing the users, and finally deleting them. In addition to the standard checks, we also wrote tests ensuring coverage of edge case behavior.\nNote that when a user accesses Automatisch, they must provide their email address as a username.",{"type":26,"tag":35,"props":248,"children":249},{},[250],{"type":32,"value":251},"We included tests in the administrator workflow ensuring a second user cannot be created with the same email address as an existing user. In addition, there are tests ensuring that if an administrator attempts to edit one user to have the same email as another existing user, this action cannot be performed as well.",{"type":26,"tag":35,"props":253,"children":254},{},[255],{"type":32,"value":256},"One of the challenges we ran into while writing these tests was ensuring the notifications plugin was not interfering with test behavior. After performing an action, a notification in the application would be displayed showing whether or not the action was successful. For example, if we tried editing the information of a user, either a success notification or error notification will be displayed after submitting the edit form.",{"type":26,"tag":35,"props":258,"children":259},{},[260,262,268],{"type":32,"value":261},"We overcame these challenges by upgrading the library used so we could put ",{"type":26,"tag":223,"props":263,"children":265},{"className":264},[],[266],{"type":32,"value":267},"data-",{"type":32,"value":269}," props on the associated HTML mounted to the page for any of the notifications. This way we could check the status of the notification, the text included, and giving us a way to close the notification after our test is done validating its information.",{"type":26,"tag":82,"props":271,"children":273},{"id":272},"role-management",[274],{"type":32,"value":275},"Role Management",{"type":26,"tag":35,"props":277,"children":278},{},[279],{"type":32,"value":280},"Another part of Automatisch requiring test coverage was role management. Automatisch provides an strong Role Based Access Control (RBAC) authorization system controlling which actions a user is able to perform. There are permissions for reading, creating, updating, and deleting, for many different sets of features within Automatisch. These features RBAC controls includes creating workflows integrating various third party software together, creating new connections to third party vendors, and managing executions of the workflows.",{"type":26,"tag":35,"props":282,"children":283},{},[284],{"type":32,"value":285},"We wrote integration tests for each of these sets of permissions, ensuring they worked as intended, and ensured the interface behaved as expected when the logged-in user did or did not have the relevant permission.",{"type":26,"tag":35,"props":287,"children":288},{},[289],{"type":32,"value":290},"In addition to these tests on permission, we also created test coverage for the admin workflows for managing these roles and permissions. This includes the standard creating, updating, and deleting of roles. In addition, we added coverage for edge case behavior similar to the edge cases found in the administration of users.",{"type":26,"tag":27,"props":292,"children":294},{"id":293},"ci-pipeline-enhancements",[295],{"type":32,"value":296},"CI Pipeline Enhancements",{"type":26,"tag":35,"props":298,"children":299},{},[300],{"type":32,"value":301},"Automatisch serves a diverse range of users, from open source self-hosted users to enterprise clients. Being able to push updates to this diverse user base requires adequate testing covering functionality available to both sets of users. Part of this equation is testing in the CI pipeline all types of end-users, ensuring robust updates of the software. We supported Automatisch in crafting their CI pipeline with GitHub actions, giving test support for both self-hosted and enterprise features during development, ultimately building a reliable development ecosystem.",{"type":26,"tag":27,"props":303,"children":305},{"id":304},"tangible-value",[306],{"type":32,"value":307},"Tangible Value",{"type":26,"tag":35,"props":309,"children":310},{},[311],{"type":32,"value":312},"Already with our test work is Automatisch reaping the benefits from these automated checks. Currently they are working on a major restructuring of their application, moving the previous GraphQL API to the current REST API. Their main lighthouse guiding them throughout this process has been their test suite, since it has given them assurance these major structural changes to their codebase are not interfering with the already existing features and workflows supported on their platform.",{"title":7,"searchDepth":314,"depth":314,"links":315},2,[316,317,318,323,328,329],{"id":29,"depth":314,"text":33},{"id":52,"depth":314,"text":55},{"id":77,"depth":314,"text":80,"children":319},[320,322],{"id":84,"depth":321,"text":87},3,{"id":136,"depth":321,"text":139},{"id":202,"depth":314,"text":205,"children":324},[325,326,327],{"id":213,"depth":321,"text":216},{"id":233,"depth":321,"text":236},{"id":272,"depth":321,"text":275},{"id":293,"depth":314,"text":296},{"id":304,"depth":314,"text":307},"markdown","content:case-studies:automatisch.md","content","case-studies/automatisch.md","md",1711327637539]