[{"data":1,"prerenderedAt":792},["ShallowReactive",2],{"content-query-InhJyj2aeT":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":5,"title":7,"description":8,"body":9,"_type":787,"_id":788,"_source":789,"_file":790,"_extension":791},"/terms-of-service","",false,"Terms Of Service","Welcome to the Terms of Service (\"Terms\") for QAComet's QA/Testing services. These Terms govern your use of our productized service company specializing in Quality Assurance and Testing (\"Services\"). By accessing or using our Services, you agree to be bound by these Terms.",{"type":10,"children":11,"toc":768},"root",[12,19,24,29,34,39,46,57,67,77,87,97,107,117,127,137,147,157,167,173,184,189,194,199,204,209,214,219,224,230,239,244,249,254,260,269,274,279,284,290,299,304,309,314,320,329,334,339,344,349,354,359,365,374,379,384,389,394,399,404,409,414,420,429,434,439,444,449,454,459,464,469,474,479,485,496,501,506,511,516,521,526,532,537,542,547,552,558,567,572,577,582,587,592,597,603,612,617,622,627,632,637,642,647,653,662,667,672,677,682,688,697,702,707,721,726,732,741,746,751,757],{"type":13,"tag":14,"props":15,"children":16},"element","p",{},[17],{"type":18,"value":8},"text",{"type":13,"tag":14,"props":20,"children":21},{},[22],{"type":18,"value":23},"These Terms outline the rights and responsibilities of both our company and our clients in relation to the provision and use of our Services. It is important to review and understand these Terms before utilizing our Services.",{"type":13,"tag":14,"props":25,"children":26},{},[27],{"type":18,"value":28},"Our commitment to transparency and clarity is reflected in these Terms, which cover various aspects of our business relationship, including ownership of materials, services offered, client responsibilities, billing and payments, intellectual property rights, limitation of liability, dispute resolution, and more.",{"type":13,"tag":14,"props":30,"children":31},{},[32],{"type":18,"value":33},"By agreeing to these Terms, you acknowledge that QAComet may collect, store, and use certain information as outlined in our Privacy Policy, which is incorporated into these Terms by reference.",{"type":13,"tag":14,"props":35,"children":36},{},[37],{"type":18,"value":38},"We value open communication and strive to maintain a collaborative and mutually beneficial relationship with our clients. If you have any questions or concerns about these Terms or our Services, please do not hesitate to contact us.",{"type":13,"tag":40,"props":41,"children":43},"h2",{"id":42},"definitions",[44],{"type":18,"value":45},"Definitions:",{"type":13,"tag":14,"props":47,"children":48},{},[49,55],{"type":13,"tag":50,"props":51,"children":52},"strong",{},[53],{"type":18,"value":54},"Client",{"type":18,"value":56},": Refers to individuals or entities who utilize QAComet's QA/Testing services.",{"type":13,"tag":14,"props":58,"children":59},{},[60,65],{"type":13,"tag":50,"props":61,"children":62},{},[63],{"type":18,"value":64},"Company",{"type":18,"value":66},": Refers to QAComet, the provider of QA/Testing services as outlined in these Terms.",{"type":13,"tag":14,"props":68,"children":69},{},[70,75],{"type":13,"tag":50,"props":71,"children":72},{},[73],{"type":18,"value":74},"Services",{"type":18,"value":76},": Refers to the productized service company specializing in Quality Assurance and Testing offered by QAComet, including but not limited to testing processes, consultation, and other related services provided by the Company.",{"type":13,"tag":14,"props":78,"children":79},{},[80,85],{"type":13,"tag":50,"props":81,"children":82},{},[83],{"type":18,"value":84},"Materials",{"type":18,"value":86},": Includes code, scripts, libraries, and utility methods utilized in the provision of QA/Testing services. This also encompasses any deliverables or intellectual property created or provided by the Company during the course of providing the Services.",{"type":13,"tag":14,"props":88,"children":89},{},[90,95],{"type":13,"tag":50,"props":91,"children":92},{},[93],{"type":18,"value":94},"Ownership",{"type":18,"value":96},": Refers to the legal rights and responsibilities associated with the Materials and other deliverables provided by the Company, as outlined in these Terms.",{"type":13,"tag":14,"props":98,"children":99},{},[100,105],{"type":13,"tag":50,"props":101,"children":102},{},[103],{"type":18,"value":104},"Client-Specific Utilities",{"type":18,"value":106},": Refers to any tools, scripts, or methodologies specifically developed or customized for a particular client's use during the provision of the Services.",{"type":13,"tag":14,"props":108,"children":109},{},[110,115],{"type":13,"tag":50,"props":111,"children":112},{},[113],{"type":18,"value":114},"Design Patterns",{"type":18,"value":116},": Refers to recurring solutions to common design problems encountered in software development, which may be utilized by the Company across multiple projects.",{"type":13,"tag":14,"props":118,"children":119},{},[120,125],{"type":13,"tag":50,"props":121,"children":122},{},[123],{"type":18,"value":124},"Trial Period",{"type":18,"value":126},": Refers to the specified duration during which clients may access a limited version of the Services for evaluation purposes before committing to a full subscription.",{"type":13,"tag":14,"props":128,"children":129},{},[130,135],{"type":13,"tag":50,"props":131,"children":132},{},[133],{"type":18,"value":134},"Subscription Fee",{"type":18,"value":136},": Refers to the recurring payment charged by the Company for continued access to the Services, typically on a monthly basis.",{"type":13,"tag":14,"props":138,"children":139},{},[140,145],{"type":13,"tag":50,"props":141,"children":142},{},[143],{"type":18,"value":144},"Intellectual Property Rights",{"type":18,"value":146},": Refers to rights associated with intellectual creations, including copyrights, trademarks, and patents, as outlined in these Terms.",{"type":13,"tag":14,"props":148,"children":149},{},[150,155],{"type":13,"tag":50,"props":151,"children":152},{},[153],{"type":18,"value":154},"Dispute Resolution",{"type":18,"value":156},": Refers to the process for resolving disagreements or conflicts between the Company and its clients, as outlined in these Terms.",{"type":13,"tag":14,"props":158,"children":159},{},[160,165],{"type":13,"tag":50,"props":161,"children":162},{},[163],{"type":18,"value":164},"Privacy Policy",{"type":18,"value":166},": Refers to the Company's policy governing the collection, use, and disclosure of personal information provided by clients, as outlined in a separate document incorporated into these Terms.",{"type":13,"tag":40,"props":168,"children":170},{"id":169},"_2-scope-of-service",[171],{"type":18,"value":172},"2. SCOPE OF SERVICE",{"type":13,"tag":14,"props":174,"children":175},{},[176,178],{"type":18,"value":177},"Summary: ",{"type":13,"tag":179,"props":180,"children":181},"em",{},[182],{"type":18,"value":183},"This detailed clause provides a comprehensive overview of the scope of services offered by QAComet, highlighting the various testing solutions and support services available to clients.",{"type":13,"tag":14,"props":185,"children":186},{},[187],{"type":18,"value":188},"QAComet is committed to providing high-quality QA/Testing services to our clients. The scope of our services encompasses a comprehensive range of testing solutions tailored to meet the unique needs of each client. Below is an outline of the services offered by QAComet:",{"type":13,"tag":14,"props":190,"children":191},{},[192],{"type":18,"value":193},"Quality Assurance Testing: QAComet specializes in conducting thorough quality assurance testing to identify and address potential issues or defects in software applications. Our testing processes encompass various methodologies, including functional testing, regression testing, performance testing, usability testing, and compatibility testing.",{"type":13,"tag":14,"props":195,"children":196},{},[197],{"type":18,"value":198},"Consultation and Advisory Services: In addition to conducting testing activities, QAComet offers consultation and advisory services to assist clients in optimizing their software development processes. Our experienced team of QA professionals provides expert guidance and recommendations on testing strategies, tools, and best practices to enhance the quality and reliability of software products.",{"type":13,"tag":14,"props":200,"children":201},{},[202],{"type":18,"value":203},"Test Automation: QAComet leverages automation tools and frameworks to streamline the testing process and improve efficiency. We develop automated test scripts tailored to the specific requirements of each project, allowing for repetitive tests to be executed quickly and accurately.",{"type":13,"tag":14,"props":205,"children":206},{},[207],{"type":18,"value":208},"Continuous Integration/Continuous Deployment (CI/CD) Integration: QAComet provides guidance and support for integrating QA testing processes into clients' CI/CD pipelines. We offer recommendations and assistance in configuring automated testing workflows, enabling seamless integration of testing activities into the software development lifecycle.",{"type":13,"tag":14,"props":210,"children":211},{},[212],{"type":18,"value":213},"Customized Testing Solutions: At QAComet, we understand that every project is unique, and one-size-fits-all approaches may not suffice. Therefore, we offer customized testing solutions tailored to the specific requirements and objectives of each client. Whether it's testing a web application, mobile app, or enterprise software solution, our team collaborates closely with clients to develop customized testing strategies that align with their goals and objectives.",{"type":13,"tag":14,"props":215,"children":216},{},[217],{"type":18,"value":218},"Client Collaboration and Support: QAComet prioritizes open communication and collaboration with clients throughout the testing process. Our team works closely with clients to understand their requirements, address any concerns or questions, and ensure that testing activities are aligned with their business objectives. We provide ongoing support and assistance to clients, offering guidance and recommendations as needed to achieve optimal testing outcomes.",{"type":13,"tag":14,"props":220,"children":221},{},[222],{"type":18,"value":223},"Discretionary Services: In addition to the core services outlined above, QAComet may offer discretionary services or additional features upon mutual agreement with the client. These services may include specialized testing activities, customized reporting, or other value-added services aimed at enhancing the overall quality and effectiveness of our testing solutions.",{"type":13,"tag":40,"props":225,"children":227},{"id":226},"_3-account-security",[228],{"type":18,"value":229},"3. ACCOUNT SECURITY",{"type":13,"tag":14,"props":231,"children":232},{},[233,234],{"type":18,"value":177},{"type":13,"tag":179,"props":235,"children":236},{},[237],{"type":18,"value":238},"This clause emphasizes the importance of maintaining the security of user accounts and prohibits the sharing of login credentials or sublicensing access, effectively preventing unauthorized usage of QAComet services or materials as requested.",{"type":13,"tag":14,"props":240,"children":241},{},[242],{"type":18,"value":243},"To maintain the security and integrity of QAComet services, users are prohibited from sharing their account login credentials or sublicensing access to their account to any third party. Each user is responsible for safeguarding their account login information and ensuring that it is not shared, disclosed, or accessed by unauthorized individuals.",{"type":13,"tag":14,"props":245,"children":246},{},[247],{"type":18,"value":248},"Any unauthorized usage of QAComet services or materials resulting from the sharing of account login credentials or sublicensing of access shall be the sole responsibility of the account holder. QAComet shall not be liable for any damages, losses, or liabilities arising out of or related to the unauthorized usage of services or materials due to the violation of this provision.",{"type":13,"tag":14,"props":250,"children":251},{},[252],{"type":18,"value":253},"Users are encouraged to take proactive measures to protect the security of their accounts, including choosing strong and unique passwords, enabling two-factor authentication where available, and promptly reporting any suspected unauthorized access or usage of their account to QAComet.",{"type":13,"tag":40,"props":255,"children":257},{"id":256},"_4-right-to-refuse-or-cancel-services",[258],{"type":18,"value":259},"4. RIGHT TO REFUSE OR CANCEL SERVICES",{"type":13,"tag":14,"props":261,"children":262},{},[263,264],{"type":18,"value":177},{"type":13,"tag":179,"props":265,"children":266},{},[267],{"type":18,"value":268},"This clause empowers QAComet to make decisions regarding the provision of services and the continuation of client subscriptions, effectively capturing the necessary provisions as requested.",{"type":13,"tag":14,"props":270,"children":271},{},[272],{"type":18,"value":273},"QAComet reserves the right to refuse to provide services to prospective clients at its sole discretion. This includes but is not limited to cases where QAComet determines, in its judgment, that providing services to a prospective client may pose a risk to QAComet reputation, integrity, or ability to fulfill its obligations under these Terms of Service.",{"type":13,"tag":14,"props":275,"children":276},{},[277],{"type":18,"value":278},"In the event where QAComet cancels the service, the client will receive a prorated refund for the unused portion of the subscription term, minus a 20% cancellation fee. The refund will be processed within 30 days of cancellation. for example; If a client purchases a yearly subscription for $60000 and QAComet cancels the service after 4 months, the client will be refunded for the remaining 8 months of the subscription, minus a 20% cancellation fee. Therefore, the client will receive a refund of $36000 ($60000 - $20000 - 20% cancellation fee) within 30 days of cancellation.",{"type":13,"tag":14,"props":280,"children":281},{},[282],{"type":18,"value":283},"QAComet shall not be liable to the prospective client or existing client or any third party for any damages, losses, or liabilities arising out of or related to the refusal to provide services or the cancellation or termination of existing client subscriptions, except as otherwise provided in these Terms of Service or required by applicable law.",{"type":13,"tag":40,"props":285,"children":287},{"id":286},"_5-promotional-rights",[288],{"type":18,"value":289},"5. PROMOTIONAL RIGHTS:",{"type":13,"tag":14,"props":291,"children":292},{},[293,294],{"type":18,"value":177},{"type":13,"tag":179,"props":295,"children":296},{},[297],{"type":18,"value":298},"This Promotional Rights clause grants QAComet the right to showcase non-identifiable case studies or project examples in its marketing materials for promotional purposes, while respecting client confidentiality and privacy as requested.",{"type":13,"tag":14,"props":300,"children":301},{},[302],{"type":18,"value":303},"QAComet reserves the right to showcase non-identifiable case studies or project examples in its marketing materials for promotional purposes. By engaging QAComet services, clients grant QAComet the limited right to use non-identifiable information about their projects or engagements in marketing materials, including but not limited to website content, social media posts, presentations, and case studies.",{"type":13,"tag":14,"props":305,"children":306},{},[307],{"type":18,"value":308},"Non-identifiable information may include general descriptions of the services provided, the types of projects undertaken, and the outcomes achieved, without disclosing any confidential client information or personally identifiable information. QAComet shall take reasonable measures to ensure that any information shared in promotional materials is sufficiently anonymized and does not reveal the identity of the client or any confidential information.",{"type":13,"tag":14,"props":310,"children":311},{},[312],{"type":18,"value":313},"Clients who do not wish to have their projects or engagements included in QAComet marketing materials may opt out by notifying QAComet in writing. QAComet shall respect the client's decision and refrain from using any information about their projects or engagements in its promotional materials.",{"type":13,"tag":40,"props":315,"children":317},{"id":316},"_6-ownership-of-materials",[318],{"type":18,"value":319},"6. OWNERSHIP OF MATERIALS:",{"type":13,"tag":14,"props":321,"children":322},{},[323,324],{"type":18,"value":177},{"type":13,"tag":179,"props":325,"children":326},{},[327],{"type":18,"value":328},"This detailed clause provides clear and comprehensive guidance on the ownership of materials, while emphasizing transparency and respect for clients' intellectual property rights.",{"type":13,"tag":14,"props":330,"children":331},{},[332],{"type":18,"value":333},"The Company acknowledges and respects the importance of intellectual property rights in the provision of QA/Testing services. As such, QAComet recognizes the need for clarity regarding the ownership of materials utilized in the course of delivering our services.",{"type":13,"tag":14,"props":335,"children":336},{},[337],{"type":18,"value":338},"Client-Specific Utilities: QAComet understands that clients may have unique tools, scripts, or methodologies integral to their operations. Any utilities designed specifically for a client's use, and developed exclusively during the provision of our services, shall remain the sole property of the respective client. QAComet will neither claim nor assert any ownership rights over such client-specific utilities.",{"type":13,"tag":14,"props":340,"children":341},{},[342],{"type":18,"value":343},"Design Patterns and General Utilities: While QAComet may utilize common design patterns and general utilities across multiple projects, it is acknowledged that such patterns and utilities may not be proprietary to any individual client. Therefore, QAComet does not claim exclusive ownership over these design patterns or general utilities. However, clients shall have the right to use such patterns and utilities within the scope of the Services provided by QAComet.",{"type":13,"tag":14,"props":345,"children":346},{},[347],{"type":18,"value":348},"Deliverables and Intellectual Property: All deliverables, including code, scripts, libraries, and any other intellectual property created or provided by QAComet during the course of providing our Services, shall be owned by the respective client upon delivery. QAComet hereby grants clients a non-exclusive, perpetual, and worldwide license to use, modify, and distribute such deliverables for their internal business purposes.",{"type":13,"tag":14,"props":350,"children":351},{},[352],{"type":18,"value":353},"Non-Exclusivity: It is understood that the ownership rights outlined herein shall not preclude QAComet from using similar design patterns or utilities in the provision of services to other clients. However, QAComet shall take reasonable measures to ensure that any materials developed for one client do not infringe upon the proprietary rights of another.",{"type":13,"tag":14,"props":355,"children":356},{},[357],{"type":18,"value":358},"Client's Obligations: Clients are responsible for ensuring that they have the necessary rights, licenses, and permissions to use any materials provided to QAComet for the purpose of delivering our Services. Clients shall indemnify and hold QAComet harmless against any claims, losses, or liabilities arising from the unauthorized use of third-party materials.",{"type":13,"tag":40,"props":360,"children":362},{"id":361},"_7-client-responsibilities",[363],{"type":18,"value":364},"7. CLIENT RESPONSIBILITIES:",{"type":13,"tag":14,"props":366,"children":367},{},[368,369],{"type":18,"value":177},{"type":13,"tag":179,"props":370,"children":371},{},[372],{"type":18,"value":373},"This clause outlines the expectations and responsibilities of clients when engaging QAComet for testing services, emphasizing the importance of communication, collaboration, and cooperation throughout the testing engagement.",{"type":13,"tag":14,"props":375,"children":376},{},[377],{"type":18,"value":378},"At QAComet, we believe that successful collaboration between our team and our clients is essential to achieving optimal testing outcomes. To facilitate effective cooperation and ensure the smooth delivery of our services, clients are expected to adhere to the following responsibilities:",{"type":13,"tag":14,"props":380,"children":381},{},[382],{"type":18,"value":383},"Clear Communication: Clients are responsible for maintaining clear and open communication with QAComet throughout the duration of the testing engagement. This includes promptly responding to inquiries, providing necessary information, and addressing any questions or concerns raised by QAComet team members.",{"type":13,"tag":14,"props":385,"children":386},{},[387],{"type":18,"value":388},"Setting Up Development Environment: Clients are responsible for providing instructions and access to set up the development environment required for testing purposes. This may include granting access to development servers, providing necessary credentials, and configuring the environment according to project specifications.",{"type":13,"tag":14,"props":390,"children":391},{},[392],{"type":18,"value":393},"Task Management: Clients are responsible for managing and prioritizing testing tasks using the designated task management system, such as a GitHub issues board. This includes accurately documenting testing requirements, assigning tasks to QAComet team members, and tracking the progress of testing activities.",{"type":13,"tag":14,"props":395,"children":396},{},[397],{"type":18,"value":398},"Code Changes and Enhancements: Clients are responsible for making necessary code changes or enhancements to their software applications to facilitate more robust testing. This may involve modifying code to improve testability, providing access to additional resources or data, or implementing specific testing scenarios as requested by QAComet.",{"type":13,"tag":14,"props":400,"children":401},{},[402],{"type":18,"value":403},"Providing Support and Assistance: Clients are responsible for providing support and assistance to QAComet team members as needed to facilitate testing activities. This may include addressing technical issues, providing access to relevant systems or data, or offering guidance on the functionality and behavior of the software application being tested.",{"type":13,"tag":14,"props":405,"children":406},{},[407],{"type":18,"value":408},"Adherence to Guidelines and Best Practices: Clients are responsible for adhering to any guidelines, best practices, or recommendations provided by QAComet regarding testing processes, methodologies, or tool usage. This includes implementing any necessary changes or adjustments to their development practices to ensure compatibility with QAComet testing approach.",{"type":13,"tag":14,"props":410,"children":411},{},[412],{"type":18,"value":413},"Feedback and Collaboration: Clients are encouraged to provide feedback and collaborate with QAComet throughout the testing engagement to ensure that testing activities are aligned with their expectations and objectives. This includes sharing insights, suggestions, and concerns to help improve the effectiveness and efficiency of our testing solutions.",{"type":13,"tag":40,"props":415,"children":417},{"id":416},"_8-billing-and-payments",[418],{"type":18,"value":419},"8. BILLING AND PAYMENTS:",{"type":13,"tag":14,"props":421,"children":422},{},[423,424],{"type":18,"value":177},{"type":13,"tag":179,"props":425,"children":426},{},[427],{"type":18,"value":428},"This clause provides a clear and comprehensive overview of QAComet billing structure and payment policies, while ensuring transparency and fairness for clients.",{"type":13,"tag":14,"props":430,"children":431},{},[432],{"type":18,"value":433},"QAComet operates on a transparent and straightforward billing structure to ensure clarity and predictability for our clients. The following provisions outline the terms and conditions related to billing and payments:",{"type":13,"tag":14,"props":435,"children":436},{},[437],{"type":18,"value":438},"Subscription Fees: Clients are required to pay a subscription fee for access to QAComet QA/Testing services. The subscription fee will be determined based on the selected plan and the number of seats/licenses required by the client.",{"type":13,"tag":14,"props":440,"children":441},{},[442],{"type":18,"value":443},"Trial Period: QAComet offers a 14-day trial period for clients to evaluate our services before committing to a full subscription. During the trial period, clients will have access to a limited version of our services for a nominal fee of $50 per seat. At the end of the trial period, clients will have the option to continue their subscription at the standard monthly rate.",{"type":13,"tag":14,"props":445,"children":446},{},[447],{"type":18,"value":448},"Monthly Subscription: Upon the expiration of the trial period, clients will be charged a monthly subscription fee of $5000 per seat for continued access to QAComet services. The monthly subscription fee will be billed in advance on a recurring basis, typically on the same day each month.",{"type":13,"tag":14,"props":450,"children":451},{},[452],{"type":18,"value":453},"Subscription Pauses: Clients may request to temporarily pause their QAComet subscription, halting services and billing for a specified period of time. Clients must provide 30 days' advance written notice to initiate a subscription pause. During the pause, clients retain their account but cannot submit service requests or access QAComet resources. Ongoing subscription fees will not be charged for the duration of the pause. Clients may restart their subscription at any time and resume regular billing.",{"type":13,"tag":14,"props":455,"children":456},{},[457],{"type":18,"value":458},"Cancellation: Clients have the option to cancel their subscription to QAComet services at any time. Upon cancellation, clients will not be billed for any future subscription periods, and their access to QAComet services will be terminated at the end of the current billing cycle.",{"type":13,"tag":14,"props":460,"children":461},{},[462],{"type":18,"value":463},"Refunds: QAComet does not offer refunds for subscription fees paid in advance. However, in the event of cancellation, clients may be entitled to a pro-rated refund for any unused portion of their subscription period, calculated based on the number of remaining days in the current billing cycle.",{"type":13,"tag":14,"props":465,"children":466},{},[467],{"type":18,"value":468},"Payment Methods: QAComet accepts payment via credit card, debit card, or other electronic payment methods. Clients are responsible for ensuring that their payment information is accurate and up-to-date to avoid any disruptions to their subscription.",{"type":13,"tag":14,"props":470,"children":471},{},[472],{"type":18,"value":473},"Late Payments: Clients are responsible for making timely payments for their subscription fees. In the event of a late payment, QAComet reserves the right to suspend or terminate the client's access to our services until payment is received in full.",{"type":13,"tag":14,"props":475,"children":476},{},[477],{"type":18,"value":478},"Taxes: All subscription fees are exclusive of any applicable taxes, duties, or similar charges, which will be added to the total amount due and payable by the client.",{"type":13,"tag":40,"props":480,"children":482},{"id":481},"_9-intellectual-property-rights",[483],{"type":18,"value":484},"9. INTELLECTUAL PROPERTY RIGHTS:",{"type":13,"tag":14,"props":486,"children":487},{},[488,489,494],{"type":18,"value":177},{"type":13,"tag":179,"props":490,"children":491},{},[492],{"type":18,"value":493},"This clause provides clarity and assurance regarding the ownership and use of intellectual property in relation to QAComet services, while emphasizing respect for clients' proprietary interests.",{"type":18,"value":495},"\nQAComet recognizes the importance of intellectual property rights and respects the proprietary interests of our clients. The following provisions outline the ownership and use of intellectual property in relation to our QA/Testing services:",{"type":13,"tag":14,"props":497,"children":498},{},[499],{"type":18,"value":500},"Client-Owned Materials: All materials provided by the client to QAComet for the purpose of conducting testing activities, including but not limited to code, scripts, data, and documentation (\"Client-Owned Materials\"), shall remain the exclusive property of the client. QAComet acknowledges and agrees that it has no ownership rights or claims to the Client-Owned Materials and shall use such materials solely for the purpose of providing the agreed-upon services.",{"type":13,"tag":14,"props":502,"children":503},{},[504],{"type":18,"value":505},"Deliverables and Work Product: Any deliverables, work product, or intellectual property created or developed by QAComet during the course of providing our services (\"Deliverables\") shall be owned by the client upon delivery. QAComet hereby assigns and transfers to the client all rights, title, and interest in and to the Deliverables, including but not limited to copyrights, patents, trademarks, and trade secrets.",{"type":13,"tag":14,"props":507,"children":508},{},[509],{"type":18,"value":510},"Non-Exclusivity: It is understood that the ownership rights granted to the client herein shall not preclude QAComet from using similar methodologies, techniques, or processes in the provision of services to other clients. However, QAComet shall take reasonable measures to ensure that the Deliverables provided to one client do not infringe upon the proprietary rights of another.",{"type":13,"tag":14,"props":512,"children":513},{},[514],{"type":18,"value":515},"Third-Party Materials: In the course of providing our services, QAComet may utilize third-party materials, including software libraries, tools, and frameworks, subject to applicable licenses and agreements. QAComet shall ensure that any third-party materials used in connection with our services are properly licensed and do not infringe upon the intellectual property rights of third parties.",{"type":13,"tag":14,"props":517,"children":518},{},[519],{"type":18,"value":520},"Confidentiality and Non-Disclosure: QAComet understands that certain information provided by the client may be confidential or proprietary in nature. QAComet agrees to maintain the confidentiality of such information and shall not disclose or use it for any purpose other than the provision of services, except as required by law or with the client's express consent.",{"type":13,"tag":14,"props":522,"children":523},{},[524],{"type":18,"value":525},"Indemnification: Clients shall indemnify, defend, and hold QAComet harmless against any claims, losses, damages, liabilities, or expenses arising from or related to the use of Client-Owned Materials or any third-party materials provided by the client. This indemnification obligation shall survive the termination of the agreement between QAComet and the client.",{"type":13,"tag":40,"props":527,"children":529},{"id":528},"_10-qacomet-pre-existing-ip-materials",[530],{"type":18,"value":531},"10. QACOMET Pre-Existing IP MATERIALS.",{"type":13,"tag":14,"props":533,"children":534},{},[535],{"type":18,"value":536},"QAComet retains all intellectual property rights to any pre-existing materials, methodologies, tools, technologies, software, and technical information developed by or licensed to QAComet prior to or outside the scope of Services provided to Client (“QAComet Materials”).",{"type":13,"tag":14,"props":538,"children":539},{},[540],{"type":18,"value":541},"QAComet grants Client a non-exclusive, non-transferable, revocable license to access and use QAComet Materials solely for Client’s internal use and benefit during an active subscription term to QAComet Services.",{"type":13,"tag":14,"props":543,"children":544},{},[545],{"type":18,"value":546},"Client may not modify, enhance, decompose, reverse engineer, alter licensing of, sublicense, distribute, or create derivative works from QAComet Materials without QAComet express written permission.",{"type":13,"tag":14,"props":548,"children":549},{},[550],{"type":18,"value":551},"Upon termination of Client’s subscription to Services: (a) all rights and licenses granted to Client for QAComet Materials will immediately cease, and (b) Client shall discontinue all use of QAComet Materials. QAComet shall retain ownership of all right, title and interest and all intellectual property rights in its Services, QAComet Materials, and anything developed or delivered by or on behalf of QAComet under this Agreement.",{"type":13,"tag":40,"props":553,"children":555},{"id":554},"_11-limitation-of-liability-and-disclaimer-of-warranties",[556],{"type":18,"value":557},"11. LIMITATION OF LIABILITY AND DISCLAIMER OF WARRANTIES:",{"type":13,"tag":14,"props":559,"children":560},{},[561,562],{"type":18,"value":177},{"type":13,"tag":179,"props":563,"children":564},{},[565],{"type":18,"value":566},"This clause provides clarity regarding QAComet liability limitations and disclaimer of warranties, while emphasizing the inherent risks associated with software testing.",{"type":13,"tag":14,"props":568,"children":569},{},[570],{"type":18,"value":571},"QAComet strives to provide high-quality QA/Testing services to our clients. However, it is important to recognize that software testing is inherently complex, and certain risks may be inherent in the testing process. The following provisions outline the limitations of liability and disclaimer of warranties associated with our services:",{"type":13,"tag":14,"props":573,"children":574},{},[575],{"type":18,"value":576},"Limitation of Liability: In no event shall QAComet, its officers, directors, employees, agents, or affiliates be liable to the client or any third party for any indirect, incidental, special, consequential, or punitive damages, including but not limited to loss of profits, loss of data, or loss of business opportunities, arising out of or in connection with the use of our services, regardless of the cause of action, whether in contract, tort, or otherwise, even if QAComet has been advised of the possibility of such damages. QAComet does not warrant that our services will be uninterrupted, error-free, or free from defects. However, QAComet will make reasonable efforts to correct any defects identified by the client while the client maintains an active paid subscription to QAComet services. If QAComet discontinues services for any reason, any responsibility for ongoing defect resolution will cease along with the cancellation of active subscriptions and service access.",{"type":13,"tag":14,"props":578,"children":579},{},[580],{"type":18,"value":581},"Disclaimer of Warranties: QAComet makes no warranties, express or implied, regarding the accuracy, completeness, reliability, or suitability of our services for any particular purpose. QAComet expressly disclaims all warranties, including but not limited to warranties of merchantability, fitness for a particular purpose, and non-infringement. QAComet does not warrant that our services will be uninterrupted, error-free, or free from defects, or that any defects will be corrected.",{"type":13,"tag":14,"props":583,"children":584},{},[585],{"type":18,"value":586},"Assumption of Risk: The client acknowledges and agrees that the use of QAComet services involves certain risks, including but not limited to the risk of software errors, defects, or failures. The client assumes all responsibility and liability for any consequences arising from the use of our services, including but not limited to the use of any deliverables or recommendations provided by QAComet.",{"type":13,"tag":14,"props":588,"children":589},{},[590],{"type":18,"value":591},"Limitation of Remedies: The client's sole and exclusive remedy for any dissatisfaction with QAComet services shall be to discontinue the use of our services. In no event shall QAComet total liability to the client exceed the total amount paid by the client to QAComet for the specific services giving rise to the claim during the six (6) months preceding the date of the claim.",{"type":13,"tag":14,"props":593,"children":594},{},[595],{"type":18,"value":596},"No Professional Advice: While QAComet provides quality assurance testing services and may offer related recommendations to clients as part of our standard services, this does not constitute formal professional advice. If seeking guidance for decision-making purposes or recommendations upon which clients will solely rely, clients should obtain independent professional consultation suited to their unique needs and circumstances.",{"type":13,"tag":40,"props":598,"children":600},{"id":599},"_12-confidentiality",[601],{"type":18,"value":602},"12. CONFIDENTIALITY:",{"type":13,"tag":14,"props":604,"children":605},{},[606,607],{"type":18,"value":177},{"type":13,"tag":179,"props":608,"children":609},{},[610],{"type":18,"value":611},"This clause outlines the obligations, responsibilities, and protections regarding the confidentiality of client information, while emphasizing QAComet commitment to safeguarding client data.",{"type":13,"tag":14,"props":613,"children":614},{},[615],{"type":18,"value":616},"QAComet recognizes the importance of maintaining the confidentiality and security of our clients' sensitive information. The following provisions outline the obligations and responsibilities of both QAComet and our clients with respect to confidentiality:",{"type":13,"tag":14,"props":618,"children":619},{},[620],{"type":18,"value":621},"Definition of Confidential Information: For the purposes of these Terms, \"Confidential Information\" shall include any non-public information disclosed by either party to the other party, either directly or indirectly, in writing, orally, or by inspection of tangible objects, that is designated as confidential or that reasonably should be understood to be confidential given the nature of the information and the circumstances of disclosure. Confidential Information may include, but is not limited to, trade secrets, business plans, financial information, technical data, and proprietary methodologies.",{"type":13,"tag":14,"props":623,"children":624},{},[625],{"type":18,"value":626},"Non-Disclosure: QAComet agrees to maintain the confidentiality of all Confidential Information disclosed by the client and shall not disclose such information to any third party without the client's prior written consent, except as required by law or as necessary to perform the services contemplated under these Terms. QAComet shall take reasonable measures to protect the confidentiality of the client's Confidential Information, including implementing appropriate security safeguards and access controls.",{"type":13,"tag":14,"props":628,"children":629},{},[630],{"type":18,"value":631},"Use of Confidential Information: QAComet agrees to use the client's Confidential Information solely for the purpose of providing the agreed-upon services and shall not use such information for any other purpose without the client's prior written consent. QAComet shall ensure that its employees, contractors, or agents who have access to the client's Confidential Information are bound by obligations of confidentiality at least as protective as those set forth in these Terms.",{"type":13,"tag":14,"props":633,"children":634},{},[635],{"type":18,"value":636},"Exceptions: The obligations of confidentiality set forth herein shall not apply to any information that: (a) is or becomes publicly available through no fault of QAComet; (b) was rightfully known to QAComet prior to its disclosure by the client; (c) is independently developed by QAComet without reference to the client's Confidential Information; or (d) is rightfully obtained by QAComet from a third party without breach of any confidentiality obligation.",{"type":13,"tag":14,"props":638,"children":639},{},[640],{"type":18,"value":641},"Survival: The obligations of confidentiality set forth herein shall survive the termination of the agreement between QAComet and the client and shall continue in full force and effect thereafter.",{"type":13,"tag":14,"props":643,"children":644},{},[645],{"type":18,"value":646},"Remedies: In the event of any actual or threatened breach of confidentiality by QAComet, the client shall be entitled to seek equitable relief, including injunctive relief and specific performance, in addition to any other remedies available at law or in equity.",{"type":13,"tag":40,"props":648,"children":650},{"id":649},"_13-dispute-resolution-and-governing-law",[651],{"type":18,"value":652},"13. DISPUTE RESOLUTION AND GOVERNING LAW:",{"type":13,"tag":14,"props":654,"children":655},{},[656,657],{"type":18,"value":177},{"type":13,"tag":179,"props":658,"children":659},{},[660],{"type":18,"value":661},"This clause provides a clear framework for resolving disputes between QAComet and its clients while ensuring compliance with Colorado law.",{"type":13,"tag":14,"props":663,"children":664},{},[665],{"type":18,"value":666},"Dispute Resolution: In the event of any dispute, controversy, or claim arising out of or relating to these Terms or the provision of QA/Testing services by QAComet (\"Dispute\"), the parties agree to first attempt to resolve the Dispute amicably through good-faith negotiations. Either party may initiate the dispute resolution process by providing written notice to the other party, setting forth the nature of the Dispute and proposing a resolution.",{"type":13,"tag":14,"props":668,"children":669},{},[670],{"type":18,"value":671},"If good faith negotiations are unsuccessful within thirty (30) days from the date on which either party notifies the other party of the dispute, the parties agree to submit the dispute to mediation conducted by a mutually agreed-upon mediator in Denver, Colorado. The costs of mediation shall be shared equally by both parties.",{"type":13,"tag":14,"props":673,"children":674},{},[675],{"type":18,"value":676},"If mediation is unsuccessful in resolving the dispute within sixty (60) days from the initiation of the mediation process or if either party refuses to participate in mediation, the dispute shall be resolved by binding arbitration administered by the American Arbitration Association (AAA) in accordance with its Commercial Arbitration Rules. The arbitration shall take place in Denver, Colorado, and the arbitrator's decision shall be final and binding upon the parties. Each party shall bear its own costs and expenses associated with the arbitration, including attorneys' fees, unless otherwise awarded by the arbitrator.",{"type":13,"tag":14,"props":678,"children":679},{},[680],{"type":18,"value":681},"Governing Law: These Terms shall be governed by and construed in accordance with the laws of the State of Colorado, without regard to its conflicts of laws principles. Any legal action or proceeding arising out of or relating to these Terms or the provision of QA/Testing services by QAComet shall be brought exclusively in the state or federal courts located in Denver County, Colorado, and the parties hereby consent to the jurisdiction and venue of such courts.",{"type":13,"tag":40,"props":683,"children":685},{"id":684},"_14-modification-and-termination",[686],{"type":18,"value":687},"14. MODIFICATION AND TERMINATION:",{"type":13,"tag":14,"props":689,"children":690},{},[691,692],{"type":18,"value":177},{"type":13,"tag":179,"props":693,"children":694},{},[695],{"type":18,"value":696},"This clause provides clarity regarding QAComet ability to modify and terminate its services and outlines the obligations of clients in response to such modifications or terminations.",{"type":13,"tag":14,"props":698,"children":699},{},[700],{"type":18,"value":701},"Modification of Terms: QAComet reserves the right to modify these Terms of Service at any time. Clients will receive at least 30 days’ advance written notice of any modifications by email or through the QAComet platform. Changes will be effective 30 days after the notice date. Continued use of QAComet services after the 30-day notice period indicates Client acceptance of the updated Terms. If the modifications are not acceptable, Client may terminate their subscription prior to the updates taking effect.",{"type":13,"tag":14,"props":703,"children":704},{},[705],{"type":18,"value":706},"Termination: QAComet may terminate service and cancel Client subscriptions at any time, with or without cause, with 30 days’ advance written notice. Client data or access may continue for the notice period or cease immediately depending on the reason for termination. In the event of termination, QAComet shall not be liable to Client for any damages, losses, or liabilities arising out of or related to such termination.",{"type":13,"tag":14,"props":708,"children":709},{},[710,712,719],{"type":18,"value":711},"Client Termination: Clients may terminate their QAComet subscription with 30 days’ advance written notice at any time by emailing ",{"type":13,"tag":713,"props":714,"children":716},"a",{"href":715},"mailto:contact@qacomet.com",[717],{"type":18,"value":718},"contact@qacomet.com",{"type":18,"value":720},".",{"type":13,"tag":14,"props":722,"children":723},{},[724],{"type":18,"value":725},"Survival: Sections of these Terms including Confidentiality, Indemnification, Limitation of Liability, and those related to QAComet ownership rights shall survive any termination expiration of these Terms of Service.",{"type":13,"tag":40,"props":727,"children":729},{"id":728},"_15-severability",[730],{"type":18,"value":731},"15. SEVERABILITY",{"type":13,"tag":14,"props":733,"children":734},{},[735,736],{"type":18,"value":177},{"type":13,"tag":179,"props":737,"children":738},{},[739],{"type":18,"value":740},"This clause provides assurance to QAComet and its clients that the validity and enforceability of the Terms will be preserved to the fullest extent possible",{"type":13,"tag":14,"props":742,"children":743},{},[744],{"type":18,"value":745},"In the event that any provision of these Terms of Service is determined to be unlawful, void, or unenforceable by a court of competent jurisdiction, such provision shall be deemed severable from these Terms and shall not affect the validity and enforceability of any remaining provisions.",{"type":13,"tag":14,"props":747,"children":748},{},[749],{"type":18,"value":750},"The parties agree that the court shall have the authority to modify or replace any provision of these Terms that is determined to be unlawful, void, or unenforceable with a valid and enforceable provision that most closely reflects the intent of the original provision.",{"type":13,"tag":40,"props":752,"children":754},{"id":753},"_16-contact-us",[755],{"type":18,"value":756},"16. Contact Us:",{"type":13,"tag":14,"props":758,"children":759},{},[760,762,766],{"type":18,"value":761},"For any inquiries, questions, or assistance regarding QAComet services or these Terms of Service, please feel free to contact us at ",{"type":13,"tag":713,"props":763,"children":764},{"href":715},[765],{"type":18,"value":718},{"type":18,"value":767},". We welcome your feedback and are committed to providing prompt and helpful assistance to our clients.",{"title":5,"searchDepth":769,"depth":769,"links":770},2,[771,772,773,774,775,776,777,778,779,780,781,782,783,784,785,786],{"id":42,"depth":769,"text":45},{"id":169,"depth":769,"text":172},{"id":226,"depth":769,"text":229},{"id":256,"depth":769,"text":259},{"id":286,"depth":769,"text":289},{"id":316,"depth":769,"text":319},{"id":361,"depth":769,"text":364},{"id":416,"depth":769,"text":419},{"id":481,"depth":769,"text":484},{"id":528,"depth":769,"text":531},{"id":554,"depth":769,"text":557},{"id":599,"depth":769,"text":602},{"id":649,"depth":769,"text":652},{"id":684,"depth":769,"text":687},{"id":728,"depth":769,"text":731},{"id":753,"depth":769,"text":756},"markdown","content:terms-of-service.md","content","terms-of-service.md","md",1720565580982]