{"_path":"/case-studies/automatisch","_dir":"case-studies","_draft":false,"_partial":false,"_locale":"","title":"Automatisch","description":"W","subtitle":"Going from the launch pad to the cosmos with E2E testing","breadcrumbs":[{"name":"Case Studies","path":"/case-studies"},{"name":"Automatisch","path":"/case-studies/automatisch"}],"link":"/case-studies/automatisch","created":{"string":"February 26, 2024","month":"Feb","day":26,"year":2024},"shortDescription":"We've recently worked with Automatisch.io and provided numerous testing and QA services supporting their codebase.","body":{"type":"root","children":[{"type":"element","tag":"h2","props":{"id":"about-automatisch"},"children":[{"type":"text","value":"About Automatisch"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://automatisch.io","rel":["nofollow"]},"children":[{"type":"text","value":"Automatisch"}]},{"type":"text","value":" is an open source Zapier alternative built upon a variety of node libraries. Their product already has several dozen integrations with other platforms, and are in progress with many more. Their QA needs were based on building automated smoke tests using playwright, finding and reporting bugs, and ensuring their CI pipeline supports features from both the community edition and enterprise edition."}]},{"type":"element","tag":"h2","props":{"id":"testing-needs"},"children":[{"type":"text","value":"Testing Needs"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"While working with Automatisch, we wrote up a number of tests covering a wide net over the application use cases. This includes writing tests for the administration of users and roles, permissions, and core application functionality."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Testing user administration can be error prone because of hard to find bugs. Our approach was to take a serial approach covering a wide variety of use cases and edge cases, ensuring that app functionality conformed with the actual product requirements. In addition we tested various permissions cases, finding edge case bugs in the process, and writing test code ensuring these problems don't find their way back into the code at a later date."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"While writing our tests we made sure to follow best practices such as integrating test ID's into application components, ensuring the tests were robust to future redesigns and component movements. Moreover, we made sure our tests were easy to read and followed a testing strategy with short quick to parse steps. This way a future developer could look through a test and instantly grok the 10 lines or less of test code and understand what kind of actions the test code is making. Transparency is key for maintainable tests."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In addition to this work, we also refactored and cleaned up previous tests into more manageable and readable tests which follow best practices. Also, we helped guide current developers towards writing test code following best practices."}]},{"type":"element","tag":"h2","props":{"id":"bug-finding"},"children":[{"type":"text","value":"Bug Finding"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"During the test development process, we ran into several bugs and rough edges in the product. After finding a potential bug, we pinged Automatisch if the issue was known, and then submitted a public issue on github. These issues were well formatted and generally included an overview of the bug or issue, along with screenshots, steps for reproducing the bug, and finally recommendations for improvement, if they were desired."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For an example, "},{"type":"element","tag":"a","props":{"href":"https://github.com/automatisch/automatisch/issues/1370","rel":["nofollow"]},"children":[{"type":"text","value":"see here"}]},{"type":"text","value":", where we found a host of UX/UI issues if a user only has certain permissions and attempts some unauthorized actions."}]},{"type":"element","tag":"h2","props":{"id":"ci-pipeline"},"children":[{"type":"text","value":"CI Pipeline"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Automatisch's product supports a wide variety of users, from open source self-hosted users to enterprises, their product supports a wide gamut of use cases. Because of this, ensuring the product correctly tests all enterprise features during development, we helped guide them while building their CI pipeline to all potential use cases. This means the tests are run against an environment which has all possible features available."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"about-automatisch","depth":2,"text":"About Automatisch"},{"id":"testing-needs","depth":2,"text":"Testing Needs"},{"id":"bug-finding","depth":2,"text":"Bug Finding"},{"id":"ci-pipeline","depth":2,"text":"CI Pipeline"}]}},"_type":"markdown","_id":"content:case-studies:automatisch.md","_source":"content","_file":"case-studies/automatisch.md","_extension":"md"}