{"generatedAt":1708130895589,"generateTime":1614,"contents":[{"_path":"/case-studies/automatisch","_dir":"case-studies","_draft":false,"_partial":false,"_locale":"","title":"Automatisch","description":"","body":{"type":"root","children":[{"type":"element","tag":"h2","props":{"id":"about-automatisch"},"children":[{"type":"text","value":"About Automatisch"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Automatisch is an open source Zapier alternative built upon a variety of node libraries. Their product already has several dozen integrations with other platforms, and are in progress with many more. Their QA needs were based on building automated smoke tests using playwright, finding and reporting bugs, and ensuring their CI pipeline supports features from both the community edition and enterprise edition."}]},{"type":"element","tag":"h2","props":{"id":"testing-needs"},"children":[{"type":"text","value":"Testing Needs"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"While working with Automatisch, we wrote up a number of tests covering a wide net over the application use cases. This includes writing tests for the administration of users and roles, permissions, and core application functionality."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Testing user administration can be error prone because of hard to find bugs. Our approach was to take a serial approach covering a wide variety of use cases and edge cases, ensuring that app functionality conformed with the actual product requirements. In addition we tested various permissions cases, finding edge case bugs in the process, and writing test code ensuring these problems don't find their way back into the code at a later date."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"While writing our tests we made sure to follow best practices such as integrating test ID's into application components, ensuring the tests were robust to future redesigns and component movements. Moreover, we made sure our tests were easy to read and followed a testing strategy with short quick to parse steps. This way a future developer could look through a test and instantly grok the 10 lines or less of test code and understand what kind of actions the test code is making. Transparency is key for maintainable tests."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In addition to this work, we also refactored and cleaned up previous tests into more manageable and readable tests which follow best practices. Also, we helped guide current developers towards writing test code following best practices."}]},{"type":"element","tag":"h2","props":{"id":"bug-finding"},"children":[{"type":"text","value":"Bug Finding"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"During the test development process, we ran into several bugs and rough edges in the product. After finding a potential bug, we pinged Automatisch if the issue was known, and then submitted a public issue on github. These issues were well formatted and generally included an overview of the bug or issue, along with screenshots, steps for reproducing the bug, and finally recommendations for improvement, if they were desired."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For an example, "},{"type":"element","tag":"a","props":{"href":"https://github.com/automatisch/automatisch/issues/1370","rel":["nofollow"]},"children":[{"type":"text","value":"see here"}]},{"type":"text","value":", where we found a host of UX/UI issues if a user only has certain permissions and attempts some unauthorized actions."}]},{"type":"element","tag":"h2","props":{"id":"ci-pipeline"},"children":[{"type":"text","value":"CI Pipeline"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Automatisch's product supports a wide variety of users, from open source self-hosted users to enterprises, their product supports a wide gamut of use cases. Because of this, ensuring the product correctly tests all enterprise features during development, we helped guide them while building their CI pipeline to all potential use cases. This means the tests are run against an environment which has all possible features available."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"about-automatisch","depth":2,"text":"About Automatisch"},{"id":"testing-needs","depth":2,"text":"Testing Needs"},{"id":"bug-finding","depth":2,"text":"Bug Finding"},{"id":"ci-pipeline","depth":2,"text":"CI Pipeline"}]}},"_type":"markdown","_id":"content:case-studies:automatisch.md","_source":"content","_file":"case-studies/automatisch.md","_extension":"md"},{"_path":"/privacy-policy","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"Privacy Policy","description":"Effective Date: This Privacy Policy is effective as of February 16, 2024.","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Effective Date"}]},{"type":"text","value":": "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"This Privacy Policy is effective as of February 16, 2024."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Welcome to the Privacy Policy of QAComet (\"we,\" \"us,\" or \"our\"). This Privacy Policy outlines how we collect, use, share, and protect information obtained from visitors (\"users\" or \"you\") of the QAComet website. We are committed to safeguarding your privacy and ensuring the security of your personal information. By accessing or using the QAComet website, you acknowledge that you have read, understood, and agree to the practices described in this Privacy Policy. If you do not agree with this Privacy Policy, please refrain from using our website. This Privacy Policy applies solely to information collected by QAComet and does not apply to information collected by any third-party websites or services that may be linked to or from our website. We encourage you to review the privacy policies of those third-party websites or services before providing any personal information."}]},{"type":"element","tag":"h2","props":{"id":"definitions"},"children":[{"type":"text","value":"DEFINITIONS:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In this Privacy Policy, unless the context otherwise requires:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"\""},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"QAComet"}]},{"type":"text","value":"\" refers to the website operated by QAComet LLC accessible at QAComet.com"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"\""},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Personal Information"}]},{"type":"text","value":"\" refers to any information that can be used to identify or contact an individual, such as name, email address, postal address, phone number, or any other information voluntarily provided by the user."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"\""},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Non-Personal Information"}]},{"type":"text","value":"\" refers to data that does not directly identify an individual, including browser type, IP address, device type, operating system, and browsing behavior."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"\""},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Cookies"}]},{"type":"text","value":"\" are small text files stored on a user's device when visiting a website, used to track and analyze website usage and personalize content."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"\""},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Google Analytics"}]},{"type":"text","value":"\" is a web analytics service provided by Google LLC (\"Google\"), used to collect and analyze data about website usage, including IP addresses, browser types, operating systems, and pages visited."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"\""},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"User"}]},{"type":"text","value":"\" refers to any individual who accesses or uses the QAComet website."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"\""},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Owner"}]},{"type":"text","value":"\" refers to QAComet LLC, the entity or individual responsible for the operation and management of the QAComet website."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"By accessing or using the QAComet website, you acknowledge and agree to the terms outlined in this Privacy Policy and the definitions provided herein."}]},{"type":"element","tag":"h2","props":{"id":"_1-information-collection"},"children":[{"type":"text","value":"1. INFORMATION COLLECTION:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We collect two types of information from users: personal information and non-personal information."}]},{"type":"element","tag":"h3","props":{"id":"personal-information"},"children":[{"type":"text","value":"Personal Information:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Personal information is data that can be used to identify or contact an individual. This may include, but is not limited to, your name, email address, postal address, phone number, or any other information you voluntarily provide to us through forms on the QAComet website."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"We collect personal information only if you voluntarily submit it to us, such as when you sign up for our newsletter, register for an account, or contact us through the website."}]}]},{"type":"element","tag":"h3","props":{"id":"non-personal-information"},"children":[{"type":"text","value":"Non-Personal Information:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Non-personal information is data that does not directly identify you as an individual. This may include, but is not limited to, your browser type, IP address, device type, operating system, and browsing behavior."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"We also use cookies and similar tracking technologies to collect non-personal information about your interactions with the QAComet website. Cookies are small text files that are stored on your device when you visit a website, and they help us analyze website traffic, customize content, and improve your user experience."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"We may also use third-party services, such as Google Analytics, to collect and analyze non-personal information about website usage. These services may use cookies and other tracking technologies to gather data about your activities on the QAComet website. Please refer to the \"Google Analytics\" section of this Privacy Policy for more information."}]}]},{"type":"element","tag":"h3","props":{"id":"google-analytics"},"children":[{"type":"text","value":"Google Analytics:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"We use Google Analytics, a web analytics service provided by Google LLC (\"Google\"), to collect and analyze information about how users interact with the QAComet website."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Google Analytics uses cookies to collect data about your interactions with the website, including your IP address, browser type, operating system, referral sources, and pages visited."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"This information is transmitted to and stored by Google on servers in the United States. Google uses this information to evaluate your use of the website, compile reports on website activity for website operators, and provide other services related to website activity and internet usage."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Google may also transfer this information to third parties where required to do so by law, or where such third parties process the information on Google's behalf. Google will not associate your IP address with any other data held by Google."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"By using the QAComet website, you consent to the processing of data about you by Google in the manner and for the purposes set out above. For more information about Google's privacy practices and how Google uses data collected through Google Analytics, please see Google's Privacy Policy."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We use the information collected from users to provide, maintain, and improve the QAComet website, as well as to communicate with users, personalize content, and analyze website traffic and usage patterns. We do not sell, trade, or rent personal information to third parties without your consent."}]},{"type":"element","tag":"h2","props":{"id":"_2-use-of-information"},"children":[{"type":"text","value":"2. USE OF INFORMATION:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We use the information collected from users for the following purposes:"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"To Provide and Improve Services: We may use both personal and non-personal information to provide, maintain, and improve the QAComet website, including monitoring and analyzing website usage, identifying trends, and troubleshooting technical issues."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"To Communicate with Users: We may use personal information to communicate with users, respond to inquiries, provide customer support, and send administrative or transactional messages related to user accounts or services."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"To Personalize Content: We may use non-personal information, such as browsing behavior and preferences, to personalize content and recommendations on the QAComet website."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"To Analyze Website Traffic: We may use cookies and similar technologies, including Google Analytics, to analyze website traffic and usage patterns, track user interactions with the website, and compile statistical reports on website activity."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"For Marketing and Advertising: With user consent, we may use personal information to send promotional materials, newsletters, or other marketing communications. We may also use cookies and similar technologies to deliver targeted advertisements based on user interests and preferences."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For Legal Compliance: We may use and disclose information as necessary to comply with legal obligations, enforce our policies, protect our rights or property, or respond to lawful requests from government authorities or law enforcement agencies."}]},{"type":"element","tag":"h2","props":{"id":"_3-sharing-of-information"},"children":[{"type":"text","value":"3. SHARING OF INFORMATION:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We may share both personal and non-personal information collected from users in the following circumstances:"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Third-Party Service Providers: We may engage trusted third-party service providers to assist us in operating the QAComet website or providing services on our behalf. These service providers may have access to user information as necessary to perform their functions, but they are prohibited from using it for any other purpose."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Legal Compliance: We may disclose user information if required to do so by law or in response to valid legal requests, such as subpoenas, court orders, or other legal processes. We may also share information to protect our rights, property, or safety, or the rights, property, or safety of others."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Business Transfers: In the event of a merger, acquisition, reorganization, or sale of assets, user information may be transferred or disclosed as part of the transaction. Any such transfer will be subject to appropriate confidentiality and security measures to protect user privacy."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Consent: We may share user information with third parties if we have obtained user consent to do so. For example, we may share information with third-party partners for marketing purposes if users have opted in to such communications."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Aggregated or Anonymized Data: We may share aggregated or anonymized data derived from user information for analytical purposes or to improve our services. This data does not identify individual users and cannot be used to personally identify anyone."}]}]},{"type":"element","tag":"h2","props":{"id":"_4-google-analytics"},"children":[{"type":"text","value":"4. GOOGLE ANALYTICS:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We utilize Google Analytics, a web analytics service provided by Google LLC (\"Google\"), to collect and analyze data about user interactions with the QAComet website. Google Analytics uses cookies to gather information such as users' IP addresses, browser types, operating systems, referral sources, and pages visited. This information is transmitted to and stored by Google on servers in the United States."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Google Analytics helps us understand how users engage with the website, allowing us to improve our services, optimize website performance, and enhance user experience."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"By using the QAComet website, you consent to the processing of data about you by Google in the manner and for the purposes outlined above. You can opt out of Google Analytics tracking by installing the Google Analytics Opt-out Browser Add-on, available at the following URL: "},{"type":"element","tag":"a","props":{"href":"https://tools.google.com/dlpage/gaoptout","rel":["nofollow"]},"children":[{"type":"text","value":"Google Analytics Opt-out Browser Add-on"}]},{"type":"text","value":"."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For more information about Google's privacy practices and how Google uses data collected through Google Analytics, please refer to Google's Privacy Policy: "},{"type":"element","tag":"a","props":{"href":"https://policies.google.com/privacy?hl=en-US","rel":["nofollow"]},"children":[{"type":"text","value":"Google Privacy Policy"}]},{"type":"text","value":"."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Please note that opting out of Google Analytics tracking will not prevent your data from being collected by other analytics services or cookies used on the QAComet website."}]},{"type":"element","tag":"h2","props":{"id":"_5-data-security"},"children":[{"type":"text","value":"5. DATA SECURITY:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We are committed to protecting the security of user information and have implemented reasonable measures to safeguard personal and non-personal data collected through the QAComet website. We employ physical, technical, and administrative safeguards to prevent unauthorized access, disclosure, alteration, or destruction of user information."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Access to user information is restricted to authorized personnel who have a legitimate need to access such information for the purposes outlined in this Privacy Policy. All employees, contractors, and third-party service providers with access to user information are required to adhere to strict confidentiality obligations and undergo training on data security and privacy practices."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Despite our best efforts, no method of transmission over the internet or electronic storage is completely secure, and we cannot guarantee the absolute security of user information. Therefore, while we strive to protect user information, we cannot guarantee its security."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In the event of a data breach or unauthorized access to user information, we will take appropriate steps to mitigate the impact of the incident, notify affected users as required by law, and cooperate with regulatory authorities as necessary."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We recommend that users take precautions to protect their personal information, such as choosing strong passwords, keeping login credentials confidential, and avoiding sharing sensitive information through insecure channels."}]},{"type":"element","tag":"h2","props":{"id":"_6-user-controls"},"children":[{"type":"text","value":"6. USER CONTROLS:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Users have certain controls and choices regarding the collection and use of their information on the QAComet website:"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Cookie Preferences: Users can manage their cookie preferences and settings through their web browser. Most web browsers allow users to control cookies through settings or preferences, including accepting or rejecting cookies, deleting cookies, and disabling tracking technologies. However, please note that disabling cookies may affect the functionality of certain features on the QAComet website."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Opt-Out of Personalized Advertising: Users can opt out of personalized advertising served by third-party ad networks and ad platforms by adjusting their ad preferences or settings. Many ad networks and platforms offer opt-out mechanisms or tools for users to opt out of targeted advertising based on their interests and browsing behavior."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Google Analytics Opt-Out: Users can opt out of Google Analytics tracking by installing the Google Analytics Opt-out Browser Add-on, available at "},{"type":"element","tag":"a","props":{"href":"https://tools.google.com/dlpage/gaoptout","rel":["nofollow"]},"children":[{"type":"text","value":"Google Analytics Opt-out Browser Add-on"}]},{"type":"text","value":". This browser add-on allows users to prevent their data from being collected and used by Google Analytics."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Communication Preferences: Users can manage their communication preferences and opt out of receiving promotional emails, newsletters, or other marketing communications from QAComet by following the unsubscribe instructions provided in such communications. Please note that even if you opt out of receiving marketing communications, we may still send you transactional or administrative messages related to your account or services."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Account Settings: Registered users may have access to account settings or preferences where they can update, edit, or delete their account information, including personal information provided during registration."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"By exercising these user controls and preferences, users can better manage their privacy and make informed choices about how their information is collected, used, and shared on the QAComet website. We respect and honor user preferences regarding the handling of their information and strive to provide transparent and accessible mechanisms for users to exercise their rights."}]},{"type":"element","tag":"h2","props":{"id":"_7-changes-to-the-privacy-policy"},"children":[{"type":"text","value":"7. CHANGES TO THE PRIVACY POLICY:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QAComet reserves the right to update or modify this Privacy Policy at any time without prior notice. Any changes to the Privacy Policy will be posted on this page with an updated \"Last Updated\" date at the top of the page. We encourage users to review this Privacy Policy periodically to stay informed about how we collect, use, and protect their information."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"By continuing to access or use the QAComet website after any changes to this Privacy Policy become effective, you acknowledge and agree to the updated terms. If you do not agree with the changes to the Privacy Policy, you must discontinue your use of the QAComet website."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If we make material changes to this Privacy Policy that affect how we collect, use, or share user information, we may provide notice through the QAComet website, by email, or through other means prior to the changes taking effect. We may also obtain user consent for any material changes where required by applicable law."}]},{"type":"element","tag":"h2","props":{"id":"_8-contact-information"},"children":[{"type":"text","value":"8. CONTACT INFORMATION:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you have any questions, concerns, or inquiries about this Privacy Policy or the practices of QAComet regarding the collection, use, or disclosure of your information, please "},{"type":"element","tag":"a","props":{"href":"contact@qacomet.com"},"children":[{"type":"text","value":"Contact Us"}]}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"definitions","depth":2,"text":"DEFINITIONS:"},{"id":"_1-information-collection","depth":2,"text":"1. INFORMATION COLLECTION:","children":[{"id":"personal-information","depth":3,"text":"Personal Information:"},{"id":"non-personal-information","depth":3,"text":"Non-Personal Information:"},{"id":"google-analytics","depth":3,"text":"Google Analytics:"}]},{"id":"_2-use-of-information","depth":2,"text":"2. USE OF INFORMATION:"},{"id":"_3-sharing-of-information","depth":2,"text":"3. SHARING OF INFORMATION:"},{"id":"_4-google-analytics","depth":2,"text":"4. GOOGLE ANALYTICS:"},{"id":"_5-data-security","depth":2,"text":"5. DATA SECURITY:"},{"id":"_6-user-controls","depth":2,"text":"6. USER CONTROLS:"},{"id":"_7-changes-to-the-privacy-policy","depth":2,"text":"7. CHANGES TO THE PRIVACY POLICY:"},{"id":"_8-contact-information","depth":2,"text":"8. CONTACT INFORMATION:"}]}},"_type":"markdown","_id":"content:privacy-policy.md","_source":"content","_file":"privacy-policy.md","_extension":"md"},{"_path":"/terms-and-conditions","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"Terms And Conditions","description":"Welcome to the QAComet website (\"Website\"). This Website is owned and operated by QAComet LLC and its affiliates (\"we,\" \"us,\" or \"our\"). By accessing or using this Website, you agree to be bound by these General Terms and Conditions (\"Terms\").","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Welcome to the QAComet website (\"Website\"). This Website is owned and operated by QAComet LLC and its affiliates (\"we,\" \"us,\" or \"our\"). By accessing or using this Website, you agree to be bound by these General Terms and Conditions (\"Terms\")."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Please read these Terms carefully before accessing or using the Website. These Terms govern your use of the Website and constitute a legally binding agreement between you and QAComet. If you do not agree to these Terms, please refrain from accessing or using the Website. We reserve the right to modify these Terms at any time, and your continued use of the Website signifies your acceptance of any such changes. Please review these Terms regularly for updates. If you have any questions about these Terms or the Website, please "},{"type":"element","tag":"a","props":{"href":"mailto:contact@QAComet.com"},"children":[{"type":"text","value":"Contact Us"}]}]},{"type":"element","tag":"h2","props":{"id":"definitions"},"children":[{"type":"text","value":"DEFINITIONS"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In these General Terms and Conditions (\"Terms\"), unless the context otherwise requires:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Website"}]},{"type":"text","value":"\" refers to the QAComet website, accessible at "},{"type":"element","tag":"a","props":{"href":"https://qacomet.com/","rel":["nofollow"]},"children":[{"type":"text","value":"QAComet.com"}]},{"type":"text","value":", including all associated web pages."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"\""},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Owner"}]},{"type":"text","value":"\" refers to QAComet LLC, the entity or individual responsible for the operation and management of the Website."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"\"User,\" \"you,\" or \"your\" refers to any person or entity accessing or using the Website."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"\""},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Services"}]},{"type":"text","value":"\" refers to any products, features, or functionalities offered on the Website."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"\""},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Content"}]},{"type":"text","value":"\" encompasses all text, graphics, images, videos, audio, and any other material available on the Website."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"\""},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Affiliates"}]},{"type":"text","value":"\" includes any subsidiaries, parent companies, or other entities under common control with the Owner."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"\""},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Terms"}]},{"type":"text","value":"\" refers to these General Terms and Conditions governing the use of the Website."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"\""},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Modification"}]},{"type":"text","value":"\" denotes any change, addition, or deletion to the Terms made by the Owner at their discretion."}]},{"type":"element","tag":"h2","props":{"id":"_1-acceptance-of-terms"},"children":[{"type":"text","value":"1. ACCEPTANCE OF TERMS:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"By accessing or using the QAComet website (\"Website\"), you acknowledge that you have read, understood, and agree to be bound by these General Terms and Conditions (\"Terms\"). If you do not agree to these Terms in their entirety, you are not authorized to access or use the Website."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Your access to and use of the Website constitutes your acceptance of these Terms and your agreement to comply with all applicable laws and regulations. You agree to use the Website only for lawful purposes and in a manner consistent with these Terms and any other policies or guidelines provided by QAComet."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You further acknowledge and agree that your continued use of the Website after any modifications to these Terms constitutes your acceptance of such modifications. It is your responsibility to review these Terms regularly to stay informed of any updates or changes."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you do not agree to any provision of these Terms or any subsequent modifications, your sole recourse is to discontinue the use of the Website."}]},{"type":"element","tag":"h2","props":{"id":"_2-use-of-website"},"children":[{"type":"text","value":"2. USE OF WEBSITE"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The use of the QAComet website is subject to certain terms and conditions. By accessing or using the website, you agree to comply with these terms. You are granted permission to access and use the website for lawful purposes and in accordance with these terms. You are prohibited from using the website in any way that violates applicable laws and regulations, infringes upon the rights of others, or is harmful, threatening, defamatory, obscene, or otherwise objectionable."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When using the website, you agree to refrain from engaging in any activities that could disrupt or interfere with the proper functioning of the website or its services. This includes but is not limited to attempting to gain unauthorized access to the website, introducing viruses or other harmful code, or engaging in any form of automated data collection."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You are solely responsible for any content you post or submit on the website. By posting or submitting content, you warrant that you have the right to do so and that the content is accurate, not confidential, and does not infringe upon the rights of any third party. QAComet reserves the right to remove or edit any content that violates these terms or is otherwise objectionable."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You agree to use the website only for its intended purposes and in a manner consistent with these terms and any additional guidelines or policies provided by QAComet. QAComet may, at its sole discretion, suspend or terminate your access to the website if you violate these terms or engage in any prohibited activities"}]},{"type":"element","tag":"h2","props":{"id":"_3-intellectual-property"},"children":[{"type":"text","value":"3. INTELLECTUAL PROPERTY:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The content, features, and functionality of the QAComet website, including but not limited to text, graphics, logos, images, audio clips, video clips, software, and the arrangement thereof, are owned by QAComet, its licensors, or other providers of such material and are protected by copyright, trademark, patent, trade secret, and other intellectual property or proprietary rights laws."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You acknowledge and agree that the website and its contents are provided for your personal, non-commercial use only. Except as expressly authorized by QAComet, you may not modify, reproduce, distribute, create derivative works of, publicly display, publicly perform, republish, download, store, or transmit any of the material on the website."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You may print or download one copy of a reasonable number of pages of the website for your own personal, non-commercial use and not for further reproduction, publication, or distribution."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you wish to use any content from the QAComet website for commercial purposes or any other use not expressly permitted by these Terms, you must obtain prior written permission from QAComet or the respective rights holder. If you believe that your intellectual property rights have been infringed upon by any content on the website, please contact QAComet promptly with the relevant information, and we will investigate the matter accordingly."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The QAComet name, logo, and all related names, logos, product and service names, designs, and slogans are trademarks of QAComet or its affiliates or licensors. You may not use such marks without the prior written permission of QAComet. All other names, logos, product and service names, designs, and slogans on this website are the trademarks of their respective owners."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Any unauthorized use of the website's content or trademarks may violate copyright, trademark, and other laws and may result in civil or criminal penalties."}]},{"type":"element","tag":"h2","props":{"id":"_4-privacy-policy"},"children":[{"type":"text","value":"4. PRIVACY POLICY"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The Privacy Policy of the QAComet website governs the collection, use, and disclosure of personal information provided by users. For more detailed information about our privacy practices, including how we collect, use, and protect your personal information, please refer to our "},{"type":"element","tag":"a","props":{"href":"https://qacomet.com/privacy","rel":["nofollow"]},"children":[{"type":"text","value":"Privacy Policy"}]},{"type":"text","value":"."}]},{"type":"element","tag":"h2","props":{"id":"_5-disclaimer-of-warranties"},"children":[{"type":"text","value":"5. DISCLAIMER OF WARRANTIES:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The QAComet website is provided on an \"as-is\" and \"as-available\" basis, without any warranties or representations of any kind, whether express or implied. QAComet makes no representations or warranties regarding the accuracy, completeness, reliability, timeliness, or availability of the website or its content."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"To the fullest extent permitted by applicable law, QAComet disclaims all warranties, express or implied, including but not limited to warranties of merchantability, fitness for a particular purpose, non-infringement, or course of performance."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QAComet does not warrant that the website will be uninterrupted, secure, error-free, or free of viruses or other harmful components. Any material downloaded or otherwise obtained through the use of the website is accessed at your own discretion and risk, and you will be solely responsible for any damage to your computer system or loss of data that results from such download or use."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QAComet does not warrant or make any representations regarding the use or the results of the use of the website or its content in terms of accuracy, reliability, completeness, or otherwise."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Some jurisdictions do not allow the exclusion of certain warranties, so the above limitations may not apply to you. However, to the extent permitted by applicable law, the foregoing disclaimer shall apply to the maximum extent permitted by law."}]},{"type":"element","tag":"h2","props":{"id":"_6-limitation-of-liability"},"children":[{"type":"text","value":"6. LIMITATION OF LIABILITY:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In no event shall QAComet, its affiliates, directors, officers, employees, agents, or licensors be liable to you or any third party for any indirect, consequential, incidental, special, punitive, or exemplary damages, including but not limited to damages for loss of profits, goodwill, use, data, or other intangible losses, arising out of or in connection with your access to or use of the QAComet website or its content, regardless of whether such damages are based on warranty, contract, tort (including negligence), strict liability, or any other legal theory, and even if QAComet has been advised of the possibility of such damages."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In no event shall the total liability of QAComet, its affiliates, directors, officers, employees, agents, or licensors to you for all claims arising out of or in connection with your use of the website exceed the amount paid by you, if any, to QAComet for accessing or using the website during the twelve-month period immediately preceding the event giving rise to such liability."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The limitations of liability set forth in this clause apply even if any exclusive remedy provided herein fails of its essential purpose. Some jurisdictions do not allow the limitation or exclusion of liability for incidental or consequential damages, so the above limitations may not apply to you. However, to the extent permitted by applicable law, the foregoing limitation of liability shall apply to the maximum extent permitted by law."}]},{"type":"element","tag":"h2","props":{"id":"_7-modification-and-termination"},"children":[{"type":"text","value":"7. MODIFICATION AND TERMINATION:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QAComet reserves the right, at its sole discretion, to modify or terminate the website or any part thereof, including but not limited to its content, features, or availability, at any time without prior notice. QAComet may also modify these General Terms and Conditions (\"Terms\") at any time by posting the amended terms on the website. Your continued use of the website following any such changes constitutes your acceptance of the modified Terms."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QAComet may terminate or suspend your access to all or any part of the website at any time, with or without cause, and with or without notice, for any reason or no reason, including but not limited to your breach of these Terms. Upon termination of your access to the website, all licenses and rights granted to you under these Terms shall immediately terminate, and you shall cease all use of the website."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Upon any termination of the website or your access to it, all provisions of these Terms which by their nature should survive termination, including but not limited to ownership provisions, warranty disclaimers, indemnity, and limitations of liability, shall survive termination."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QAComet shall not be liable to you or any third party for any modification, suspension, or termination of the website or your access to it."}]},{"type":"element","tag":"h2","props":{"id":"_8-governing-law-and-dispute-resolution"},"children":[{"type":"text","value":"8. GOVERNING LAW AND DISPUTE RESOLUTION:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"These General Terms and Conditions (\"Terms\") and any dispute arising out of or related to them or the QAComet website shall be governed by and construed in accordance with the laws of the State of Colorado, United States, without regard to its conflict of law principles."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Any dispute, controversy, or claim arising out of or relating to these Terms, including but not limited to their formation, interpretation, breach, termination, or validity, shall be exclusively resolved by binding arbitration in Denver, Colorado, administered by the American Arbitration Association (AAA) in accordance with its Commercial Arbitration Rules. The arbitration shall be conducted before a single arbitrator chosen in accordance with the AAA rules. The decision of the arbitrator shall be final and binding upon the parties and may be enforced in any court of competent jurisdiction."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Each party shall bear its own costs, including but not limited to attorney's fees, associated with the arbitration proceedings. However, the prevailing party in any arbitration or legal proceeding arising out of or related to these Terms shall be entitled to recover its reasonable attorney's fees and costs from the other party."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Notwithstanding the foregoing, QAComet may seek injunctive or other equitable relief in any court of competent jurisdiction to prevent or stop any unauthorized use, misuse, or abuse of the website or its content without the need for posting a bond or other security."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The language of arbitration and all related proceedings shall be English."}]},{"type":"element","tag":"h2","props":{"id":"_9-miscellaneous"},"children":[{"type":"text","value":"9. MISCELLANEOUS:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Severability: If any provision of these Terms is found to be invalid, illegal, or unenforceable, the remaining provisions shall remain in full force and effect to the fullest extent permitted by law."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Entire Agreement: These Terms constitute the entire agreement between you and QAComet regarding the subject matter herein and supersede all prior or contemporaneous agreements, communications, and proposals, whether oral or written, between the parties regarding such subject matter."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Waiver: The failure of QAComet to enforce any right or provision of these Terms shall not constitute a waiver of such right or provision. Any waiver of any provision of these Terms will be effective only if in writing and signed by QAComet."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Assignment: These Terms, and any rights and licenses granted hereunder, may not be transferred or assigned by you, but may be assigned by QAComet without restriction."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Headings: The headings used in these Terms are for convenience only and shall not affect the construction or interpretation of these Terms."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Language: These Terms may be translated into other languages for convenience, but the English version shall prevail in the event of any conflict or discrepancy."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Survival: Sections regarding intellectual property, disclaimer of warranties, limitation of liability, governing law and dispute resolution, and any other provisions which by their nature should survive termination, shall survive any termination or expiration of these Terms."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Contact Information: If you have any questions about these Terms or the QAComet website, please "},{"type":"element","tag":"a","props":{"href":"mailto:contact@QAComet.com"},"children":[{"type":"text","value":"Contact Us"}]}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"definitions","depth":2,"text":"DEFINITIONS"},{"id":"_1-acceptance-of-terms","depth":2,"text":"1. ACCEPTANCE OF TERMS:"},{"id":"_2-use-of-website","depth":2,"text":"2. USE OF WEBSITE"},{"id":"_3-intellectual-property","depth":2,"text":"3. INTELLECTUAL PROPERTY:"},{"id":"_4-privacy-policy","depth":2,"text":"4. PRIVACY POLICY"},{"id":"_5-disclaimer-of-warranties","depth":2,"text":"5. DISCLAIMER OF WARRANTIES:"},{"id":"_6-limitation-of-liability","depth":2,"text":"6. LIMITATION OF LIABILITY:"},{"id":"_7-modification-and-termination","depth":2,"text":"7. MODIFICATION AND TERMINATION:"},{"id":"_8-governing-law-and-dispute-resolution","depth":2,"text":"8. GOVERNING LAW AND DISPUTE RESOLUTION:"},{"id":"_9-miscellaneous","depth":2,"text":"9. MISCELLANEOUS:"}]}},"_type":"markdown","_id":"content:terms-and-conditions.md","_source":"content","_file":"terms-and-conditions.md","_extension":"md"},{"_path":"/terms-of-service","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"Terms Of Service","description":"Welcome to the Terms of Service (\"Terms\") for QAComet's QA/Testing services. These Terms govern your use of our productized service company specializing in Quality Assurance and Testing (\"Services\"). By accessing or using our Services, you agree to be bound by these Terms.","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Welcome to the Terms of Service (\"Terms\") for QAComet's QA/Testing services. These Terms govern your use of our productized service company specializing in Quality Assurance and Testing (\"Services\"). By accessing or using our Services, you agree to be bound by these Terms."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"These Terms outline the rights and responsibilities of both our company and our clients in relation to the provision and use of our Services. It is important to review and understand these Terms before utilizing our Services."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Our commitment to transparency and clarity is reflected in these Terms, which cover various aspects of our business relationship, including ownership of materials, services offered, client responsibilities, billing and payments, intellectual property rights, limitation of liability, dispute resolution, and more."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"By agreeing to these Terms, you acknowledge that QAComet may collect, store, and use certain information as outlined in our Privacy Policy, which is incorporated into these Terms by reference."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We value open communication and strive to maintain a collaborative and mutually beneficial relationship with our clients. If you have any questions or concerns about these Terms or our Services, please do not hesitate to contact us."}]},{"type":"element","tag":"h2","props":{"id":"definitions"},"children":[{"type":"text","value":"Definitions:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Client"}]},{"type":"text","value":": Refers to individuals or entities who utilize QAComet's QA/Testing services."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Company"}]},{"type":"text","value":": Refers to QAComet, the provider of QA/Testing services as outlined in these Terms."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Services"}]},{"type":"text","value":": Refers to the productized service company specializing in Quality Assurance and Testing offered by QAComet, including but not limited to testing processes, consultation, and other related services provided by the Company."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Materials"}]},{"type":"text","value":": Includes code, scripts, libraries, and utility methods utilized in the provision of QA/Testing services. This also encompasses any deliverables or intellectual property created or provided by the Company during the course of providing the Services."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Ownership"}]},{"type":"text","value":": Refers to the legal rights and responsibilities associated with the Materials and other deliverables provided by the Company, as outlined in these Terms."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Client-Specific Utilities"}]},{"type":"text","value":": Refers to any tools, scripts, or methodologies specifically developed or customized for a particular client's use during the provision of the Services."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Design Patterns"}]},{"type":"text","value":": Refers to recurring solutions to common design problems encountered in software development, which may be utilized by the Company across multiple projects."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Trial Period"}]},{"type":"text","value":": Refers to the specified duration during which clients may access a limited version of the Services for evaluation purposes before committing to a full subscription."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Subscription Fee"}]},{"type":"text","value":": Refers to the recurring payment charged by the Company for continued access to the Services, typically on a monthly basis."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Intellectual Property Rights"}]},{"type":"text","value":": Refers to rights associated with intellectual creations, including copyrights, trademarks, and patents, as outlined in these Terms."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Dispute Resolution"}]},{"type":"text","value":": Refers to the process for resolving disagreements or conflicts between the Company and its clients, as outlined in these Terms."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Privacy Policy"}]},{"type":"text","value":": Refers to the Company's policy governing the collection, use, and disclosure of personal information provided by clients, as outlined in a separate document incorporated into these Terms."}]},{"type":"element","tag":"h2","props":{"id":"_2-scope-of-service"},"children":[{"type":"text","value":"2. SCOPE OF SERVICE"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Summary: "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"This detailed clause provides a comprehensive overview of the scope of services offered by QAComet, highlighting the various testing solutions and support services available to clients."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QAComet is committed to providing high-quality QA/Testing services to our clients. The scope of our services encompasses a comprehensive range of testing solutions tailored to meet the unique needs of each client. Below is an outline of the services offered by QAComet:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Quality Assurance Testing: QAComet specializes in conducting thorough quality assurance testing to identify and address potential issues or defects in software applications. Our testing processes encompass various methodologies, including functional testing, regression testing, performance testing, usability testing, and compatibility testing."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Consultation and Advisory Services: In addition to conducting testing activities, QAComet offers consultation and advisory services to assist clients in optimizing their software development processes. Our experienced team of QA professionals provides expert guidance and recommendations on testing strategies, tools, and best practices to enhance the quality and reliability of software products."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Test Automation: QAComet leverages automation tools and frameworks to streamline the testing process and improve efficiency. We develop automated test scripts tailored to the specific requirements of each project, allowing for repetitive tests to be executed quickly and accurately."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Continuous Integration/Continuous Deployment (CI/CD) Integration: QAComet provides guidance and support for integrating QA testing processes into clients' CI/CD pipelines. We offer recommendations and assistance in configuring automated testing workflows, enabling seamless integration of testing activities into the software development lifecycle."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Customized Testing Solutions: At QAComet, we understand that every project is unique, and one-size-fits-all approaches may not suffice. Therefore, we offer customized testing solutions tailored to the specific requirements and objectives of each client. Whether it's testing a web application, mobile app, or enterprise software solution, our team collaborates closely with clients to develop customized testing strategies that align with their goals and objectives."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Client Collaboration and Support: QAComet prioritizes open communication and collaboration with clients throughout the testing process. Our team works closely with clients to understand their requirements, address any concerns or questions, and ensure that testing activities are aligned with their business objectives. We provide ongoing support and assistance to clients, offering guidance and recommendations as needed to achieve optimal testing outcomes."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Discretionary Services: In addition to the core services outlined above, QAComet may offer discretionary services or additional features upon mutual agreement with the client. These services may include specialized testing activities, customized reporting, or other value-added services aimed at enhancing the overall quality and effectiveness of our testing solutions."}]},{"type":"element","tag":"h2","props":{"id":"_3-account-security"},"children":[{"type":"text","value":"3. ACCOUNT SECURITY"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Summary: "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"This clause emphasizes the importance of maintaining the security of user accounts and prohibits the sharing of login credentials or sublicensing access, effectively preventing unauthorized usage of QAComet services or materials as requested."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"To maintain the security and integrity of QAComet services, users are prohibited from sharing their account login credentials or sublicensing access to their account to any third party. Each user is responsible for safeguarding their account login information and ensuring that it is not shared, disclosed, or accessed by unauthorized individuals."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Any unauthorized usage of QAComet services or materials resulting from the sharing of account login credentials or sublicensing of access shall be the sole responsibility of the account holder. QAComet shall not be liable for any damages, losses, or liabilities arising out of or related to the unauthorized usage of services or materials due to the violation of this provision."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Users are encouraged to take proactive measures to protect the security of their accounts, including choosing strong and unique passwords, enabling two-factor authentication where available, and promptly reporting any suspected unauthorized access or usage of their account to QAComet."}]},{"type":"element","tag":"h2","props":{"id":"_4-right-to-refuse-or-cancel-services"},"children":[{"type":"text","value":"4. RIGHT TO REFUSE OR CANCEL SERVICES"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Summary: "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"This clause empowers QAComet to make decisions regarding the provision of services and the continuation of client subscriptions, effectively capturing the necessary provisions as requested."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QAComet reserves the right to refuse to provide services to prospective clients at its sole discretion. This includes but is not limited to cases where QAComet determines, in its judgment, that providing services to a prospective client may pose a risk to QAComet reputation, integrity, or ability to fulfill its obligations under these Terms of Service."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In the event where QAComet cancels the service, the client will receive a prorated refund for the unused portion of the subscription term, minus a 20% cancellation fee. The refund will be processed within 30 days of cancellation. for example; If a client purchases a yearly subscription for $60000 and QAComet cancels the service after 4 months, the client will be refunded for the remaining 8 months of the subscription, minus a 20% cancellation fee. Therefore, the client will receive a refund of $36000 ($60000 - $20000 - 20% cancellation fee) within 30 days of cancellation."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QAComet shall not be liable to the prospective client or existing client or any third party for any damages, losses, or liabilities arising out of or related to the refusal to provide services or the cancellation or termination of existing client subscriptions, except as otherwise provided in these Terms of Service or required by applicable law."}]},{"type":"element","tag":"h2","props":{"id":"_5-promotional-rights"},"children":[{"type":"text","value":"5. PROMOTIONAL RIGHTS:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Summary: "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"This Promotional Rights clause grants QAComet the right to showcase non-identifiable case studies or project examples in its marketing materials for promotional purposes, while respecting client confidentiality and privacy as requested."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QAComet reserves the right to showcase non-identifiable case studies or project examples in its marketing materials for promotional purposes. By engaging QAComet services, clients grant QAComet the limited right to use non-identifiable information about their projects or engagements in marketing materials, including but not limited to website content, social media posts, presentations, and case studies."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Non-identifiable information may include general descriptions of the services provided, the types of projects undertaken, and the outcomes achieved, without disclosing any confidential client information or personally identifiable information. QAComet shall take reasonable measures to ensure that any information shared in promotional materials is sufficiently anonymized and does not reveal the identity of the client or any confidential information."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Clients who do not wish to have their projects or engagements included in QAComet marketing materials may opt out by notifying QAComet in writing. QAComet shall respect the client's decision and refrain from using any information about their projects or engagements in its promotional materials."}]},{"type":"element","tag":"h2","props":{"id":"_6-ownership-of-materials"},"children":[{"type":"text","value":"6. OWNERSHIP OF MATERIALS:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Summary: "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"This detailed clause provides clear and comprehensive guidance on the ownership of materials, while emphasizing transparency and respect for clients' intellectual property rights."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The Company acknowledges and respects the importance of intellectual property rights in the provision of QA/Testing services. As such, QAComet recognizes the need for clarity regarding the ownership of materials utilized in the course of delivering our services."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Client-Specific Utilities: QAComet understands that clients may have unique tools, scripts, or methodologies integral to their operations. Any utilities designed specifically for a client's use, and developed exclusively during the provision of our services, shall remain the sole property of the respective client. QAComet will neither claim nor assert any ownership rights over such client-specific utilities."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Design Patterns and General Utilities: While QAComet may utilize common design patterns and general utilities across multiple projects, it is acknowledged that such patterns and utilities may not be proprietary to any individual client. Therefore, QAComet does not claim exclusive ownership over these design patterns or general utilities. However, clients shall have the right to use such patterns and utilities within the scope of the Services provided by QAComet."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Deliverables and Intellectual Property: All deliverables, including code, scripts, libraries, and any other intellectual property created or provided by QAComet during the course of providing our Services, shall be owned by the respective client upon delivery. QAComet hereby grants clients a non-exclusive, perpetual, and worldwide license to use, modify, and distribute such deliverables for their internal business purposes."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Non-Exclusivity: It is understood that the ownership rights outlined herein shall not preclude QAComet from using similar design patterns or utilities in the provision of services to other clients. However, QAComet shall take reasonable measures to ensure that any materials developed for one client do not infringe upon the proprietary rights of another."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Client's Obligations: Clients are responsible for ensuring that they have the necessary rights, licenses, and permissions to use any materials provided to QAComet for the purpose of delivering our Services. Clients shall indemnify and hold QAComet harmless against any claims, losses, or liabilities arising from the unauthorized use of third-party materials."}]},{"type":"element","tag":"h2","props":{"id":"_7-client-responsibilities"},"children":[{"type":"text","value":"7. CLIENT RESPONSIBILITIES:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Summary: "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"This clause outlines the expectations and responsibilities of clients when engaging QAComet for testing services, emphasizing the importance of communication, collaboration, and cooperation throughout the testing engagement."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"At QAComet, we believe that successful collaboration between our team and our clients is essential to achieving optimal testing outcomes. To facilitate effective cooperation and ensure the smooth delivery of our services, clients are expected to adhere to the following responsibilities:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Clear Communication: Clients are responsible for maintaining clear and open communication with QAComet throughout the duration of the testing engagement. This includes promptly responding to inquiries, providing necessary information, and addressing any questions or concerns raised by QAComet team members."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Setting Up Development Environment: Clients are responsible for providing instructions and access to set up the development environment required for testing purposes. This may include granting access to development servers, providing necessary credentials, and configuring the environment according to project specifications."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Task Management: Clients are responsible for managing and prioritizing testing tasks using the designated task management system, such as a GitHub issues board. This includes accurately documenting testing requirements, assigning tasks to QAComet team members, and tracking the progress of testing activities."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Code Changes and Enhancements: Clients are responsible for making necessary code changes or enhancements to their software applications to facilitate more robust testing. This may involve modifying code to improve testability, providing access to additional resources or data, or implementing specific testing scenarios as requested by QAComet."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Providing Support and Assistance: Clients are responsible for providing support and assistance to QAComet team members as needed to facilitate testing activities. This may include addressing technical issues, providing access to relevant systems or data, or offering guidance on the functionality and behavior of the software application being tested."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Adherence to Guidelines and Best Practices: Clients are responsible for adhering to any guidelines, best practices, or recommendations provided by QAComet regarding testing processes, methodologies, or tool usage. This includes implementing any necessary changes or adjustments to their development practices to ensure compatibility with QAComet testing approach."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Feedback and Collaboration: Clients are encouraged to provide feedback and collaborate with QAComet throughout the testing engagement to ensure that testing activities are aligned with their expectations and objectives. This includes sharing insights, suggestions, and concerns to help improve the effectiveness and efficiency of our testing solutions."}]},{"type":"element","tag":"h2","props":{"id":"_8-billing-and-payments"},"children":[{"type":"text","value":"8. BILLING AND PAYMENTS:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Summary: "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"This clause provides a clear and comprehensive overview of QAComet billing structure and payment policies, while ensuring transparency and fairness for clients."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QAComet operates on a transparent and straightforward billing structure to ensure clarity and predictability for our clients. The following provisions outline the terms and conditions related to billing and payments:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Subscription Fees: Clients are required to pay a subscription fee for access to QAComet QA/Testing services. The subscription fee will be determined based on the selected plan and the number of seats/licenses required by the client."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Trial Period: QAComet offers a 14-day trial period for clients to evaluate our services before committing to a full subscription. During the trial period, clients will have access to a limited version of our services for a nominal fee of $50 per seat. At the end of the trial period, clients will have the option to continue their subscription at the standard monthly rate."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Monthly Subscription: Upon the expiration of the trial period, clients will be charged a monthly subscription fee of $5000 per seat for continued access to QAComet services. The monthly subscription fee will be billed in advance on a recurring basis, typically on the same day each month."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Subscription Pauses: Clients may request to temporarily pause their QAComet subscription, halting services and billing for a specified period of time. Clients must provide 30 days' advance written notice to initiate a subscription pause. During the pause, clients retain their account but cannot submit service requests or access QAComet resources. Ongoing subscription fees will not be charged for the duration of the pause. Clients may restart their subscription at any time and resume regular billing."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Cancellation: Clients have the option to cancel their subscription to QAComet services at any time. Upon cancellation, clients will not be billed for any future subscription periods, and their access to QAComet services will be terminated at the end of the current billing cycle."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Refunds: QAComet does not offer refunds for subscription fees paid in advance. However, in the event of cancellation, clients may be entitled to a pro-rated refund for any unused portion of their subscription period, calculated based on the number of remaining days in the current billing cycle."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Payment Methods: QAComet accepts payment via credit card, debit card, or other electronic payment methods. Clients are responsible for ensuring that their payment information is accurate and up-to-date to avoid any disruptions to their subscription."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Late Payments: Clients are responsible for making timely payments for their subscription fees. In the event of a late payment, QAComet reserves the right to suspend or terminate the client's access to our services until payment is received in full."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Taxes: All subscription fees are exclusive of any applicable taxes, duties, or similar charges, which will be added to the total amount due and payable by the client."}]},{"type":"element","tag":"h2","props":{"id":"_9-intellectual-property-rights"},"children":[{"type":"text","value":"9. INTELLECTUAL PROPERTY RIGHTS:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Summary: "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"This clause provides clarity and assurance regarding the ownership and use of intellectual property in relation to QAComet services, while emphasizing respect for clients' proprietary interests."}]},{"type":"text","value":"\nQAComet recognizes the importance of intellectual property rights and respects the proprietary interests of our clients. The following provisions outline the ownership and use of intellectual property in relation to our QA/Testing services:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Client-Owned Materials: All materials provided by the client to QAComet for the purpose of conducting testing activities, including but not limited to code, scripts, data, and documentation (\"Client-Owned Materials\"), shall remain the exclusive property of the client. QAComet acknowledges and agrees that it has no ownership rights or claims to the Client-Owned Materials and shall use such materials solely for the purpose of providing the agreed-upon services."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Deliverables and Work Product: Any deliverables, work product, or intellectual property created or developed by QAComet during the course of providing our services (\"Deliverables\") shall be owned by the client upon delivery. QAComet hereby assigns and transfers to the client all rights, title, and interest in and to the Deliverables, including but not limited to copyrights, patents, trademarks, and trade secrets."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Non-Exclusivity: It is understood that the ownership rights granted to the client herein shall not preclude QAComet from using similar methodologies, techniques, or processes in the provision of services to other clients. However, QAComet shall take reasonable measures to ensure that the Deliverables provided to one client do not infringe upon the proprietary rights of another."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Third-Party Materials: In the course of providing our services, QAComet may utilize third-party materials, including software libraries, tools, and frameworks, subject to applicable licenses and agreements. QAComet shall ensure that any third-party materials used in connection with our services are properly licensed and do not infringe upon the intellectual property rights of third parties."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Confidentiality and Non-Disclosure: QAComet understands that certain information provided by the client may be confidential or proprietary in nature. QAComet agrees to maintain the confidentiality of such information and shall not disclose or use it for any purpose other than the provision of services, except as required by law or with the client's express consent."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Indemnification: Clients shall indemnify, defend, and hold QAComet harmless against any claims, losses, damages, liabilities, or expenses arising from or related to the use of Client-Owned Materials or any third-party materials provided by the client. This indemnification obligation shall survive the termination of the agreement between QAComet and the client."}]},{"type":"element","tag":"h2","props":{"id":"_10-qacomet-pre-existing-ip-materials"},"children":[{"type":"text","value":"10. QACOMET Pre-Existing IP MATERIALS."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QAComet retains all intellectual property rights to any pre-existing materials, methodologies, tools, technologies, software, and technical information developed by or licensed to QAComet prior to or outside the scope of Services provided to Client (QAComet Materials)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QAComet grants Client a non-exclusive, non-transferable, revocable license to access and use QAComet Materials solely for Clients internal use and benefit during an active subscription term to QAComet Services."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Client may not modify, enhance, decompose, reverse engineer, alter licensing of, sublicense, distribute, or create derivative works from QAComet Materials without QAComet express written permission."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Upon termination of Clients subscription to Services: (a) all rights and licenses granted to Client for QAComet Materials will immediately cease, and (b) Client shall discontinue all use of QAComet Materials. QAComet shall retain ownership of all right, title and interest and all intellectual property rights in its Services, QAComet Materials, and anything developed or delivered by or on behalf of QAComet under this Agreement."}]},{"type":"element","tag":"h2","props":{"id":"_11-limitation-of-liability-and-disclaimer-of-warranties"},"children":[{"type":"text","value":"11. LIMITATION OF LIABILITY AND DISCLAIMER OF WARRANTIES:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Summary: "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"This clause provides clarity regarding QAComet liability limitations and disclaimer of warranties, while emphasizing the inherent risks associated with software testing."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QAComet strives to provide high-quality QA/Testing services to our clients. However, it is important to recognize that software testing is inherently complex, and certain risks may be inherent in the testing process. The following provisions outline the limitations of liability and disclaimer of warranties associated with our services:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Limitation of Liability: In no event shall QAComet, its officers, directors, employees, agents, or affiliates be liable to the client or any third party for any indirect, incidental, special, consequential, or punitive damages, including but not limited to loss of profits, loss of data, or loss of business opportunities, arising out of or in connection with the use of our services, regardless of the cause of action, whether in contract, tort, or otherwise, even if QAComet has been advised of the possibility of such damages. QAComet does not warrant that our services will be uninterrupted, error-free, or free from defects. However, QAComet will make reasonable efforts to correct any defects identified by the client while the client maintains an active paid subscription to QAComet services. If QAComet discontinues services for any reason, any responsibility for ongoing defect resolution will cease along with the cancellation of active subscriptions and service access."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Disclaimer of Warranties: QAComet makes no warranties, express or implied, regarding the accuracy, completeness, reliability, or suitability of our services for any particular purpose. QAComet expressly disclaims all warranties, including but not limited to warranties of merchantability, fitness for a particular purpose, and non-infringement. QAComet does not warrant that our services will be uninterrupted, error-free, or free from defects, or that any defects will be corrected."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Assumption of Risk: The client acknowledges and agrees that the use of QAComet services involves certain risks, including but not limited to the risk of software errors, defects, or failures. The client assumes all responsibility and liability for any consequences arising from the use of our services, including but not limited to the use of any deliverables or recommendations provided by QAComet."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Limitation of Remedies: The client's sole and exclusive remedy for any dissatisfaction with QAComet services shall be to discontinue the use of our services. In no event shall QAComet total liability to the client exceed the total amount paid by the client to QAComet for the specific services giving rise to the claim during the six (6) months preceding the date of the claim."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"No Professional Advice: While QAComet provides quality assurance testing services and may offer related recommendations to clients as part of our standard services, this does not constitute formal professional advice. If seeking guidance for decision-making purposes or recommendations upon which clients will solely rely, clients should obtain independent professional consultation suited to their unique needs and circumstances."}]},{"type":"element","tag":"h2","props":{"id":"_12-confidentiality"},"children":[{"type":"text","value":"12. CONFIDENTIALITY:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Summary: "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"This clause outlines the obligations, responsibilities, and protections regarding the confidentiality of client information, while emphasizing QAComet commitment to safeguarding client data."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QAComet recognizes the importance of maintaining the confidentiality and security of our clients' sensitive information. The following provisions outline the obligations and responsibilities of both QAComet and our clients with respect to confidentiality:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Definition of Confidential Information: For the purposes of these Terms, \"Confidential Information\" shall include any non-public information disclosed by either party to the other party, either directly or indirectly, in writing, orally, or by inspection of tangible objects, that is designated as confidential or that reasonably should be understood to be confidential given the nature of the information and the circumstances of disclosure. Confidential Information may include, but is not limited to, trade secrets, business plans, financial information, technical data, and proprietary methodologies."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Non-Disclosure: QAComet agrees to maintain the confidentiality of all Confidential Information disclosed by the client and shall not disclose such information to any third party without the client's prior written consent, except as required by law or as necessary to perform the services contemplated under these Terms. QAComet shall take reasonable measures to protect the confidentiality of the client's Confidential Information, including implementing appropriate security safeguards and access controls."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Use of Confidential Information: QAComet agrees to use the client's Confidential Information solely for the purpose of providing the agreed-upon services and shall not use such information for any other purpose without the client's prior written consent. QAComet shall ensure that its employees, contractors, or agents who have access to the client's Confidential Information are bound by obligations of confidentiality at least as protective as those set forth in these Terms."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Exceptions: The obligations of confidentiality set forth herein shall not apply to any information that: (a) is or becomes publicly available through no fault of QAComet; (b) was rightfully known to QAComet prior to its disclosure by the client; (c) is independently developed by QAComet without reference to the client's Confidential Information; or (d) is rightfully obtained by QAComet from a third party without breach of any confidentiality obligation."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Survival: The obligations of confidentiality set forth herein shall survive the termination of the agreement between QAComet and the client and shall continue in full force and effect thereafter."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Remedies: In the event of any actual or threatened breach of confidentiality by QAComet, the client shall be entitled to seek equitable relief, including injunctive relief and specific performance, in addition to any other remedies available at law or in equity."}]},{"type":"element","tag":"h2","props":{"id":"_13-dispute-resolution-and-governing-law"},"children":[{"type":"text","value":"13. DISPUTE RESOLUTION AND GOVERNING LAW:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Summary: "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"This clause provides a clear framework for resolving disputes between QAComet and its clients while ensuring compliance with Colorado law."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dispute Resolution: In the event of any dispute, controversy, or claim arising out of or relating to these Terms or the provision of QA/Testing services by QAComet (\"Dispute\"), the parties agree to first attempt to resolve the Dispute amicably through good-faith negotiations. Either party may initiate the dispute resolution process by providing written notice to the other party, setting forth the nature of the Dispute and proposing a resolution."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If good faith negotiations are unsuccessful within thirty (30) days from the date on which either party notifies the other party of the dispute, the parties agree to submit the dispute to mediation conducted by a mutually agreed-upon mediator in Denver, Colorado. The costs of mediation shall be shared equally by both parties."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If mediation is unsuccessful in resolving the dispute within sixty (60) days from the initiation of the mediation process or if either party refuses to participate in mediation, the dispute shall be resolved by binding arbitration administered by the American Arbitration Association (AAA) in accordance with its Commercial Arbitration Rules. The arbitration shall take place in Denver, Colorado, and the arbitrator's decision shall be final and binding upon the parties. Each party shall bear its own costs and expenses associated with the arbitration, including attorneys' fees, unless otherwise awarded by the arbitrator."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Governing Law: These Terms shall be governed by and construed in accordance with the laws of the State of Colorado, without regard to its conflicts of laws principles. Any legal action or proceeding arising out of or relating to these Terms or the provision of QA/Testing services by QAComet shall be brought exclusively in the state or federal courts located in Denver County, Colorado, and the parties hereby consent to the jurisdiction and venue of such courts."}]},{"type":"element","tag":"h2","props":{"id":"_14-modification-and-termination"},"children":[{"type":"text","value":"14. MODIFICATION AND TERMINATION:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Summary: "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"This clause provides clarity regarding QAComet ability to modify and terminate its services and outlines the obligations of clients in response to such modifications or terminations."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Modification of Terms: QAComet reserves the right to modify these Terms of Service at any time. Clients will receive at least 30 days advance written notice of any modifications by email or through the QAComet platform. Changes will be effective 30 days after the notice date. Continued use of QAComet services after the 30-day notice period indicates Client acceptance of the updated Terms. If the modifications are not acceptable, Client may terminate their subscription prior to the updates taking effect."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Termination: QAComet may terminate service and cancel Client subscriptions at any time, with or without cause, with 30 days advance written notice. Client data or access may continue for the notice period or cease immediately depending on the reason for termination. In the event of termination, QAComet shall not be liable to Client for any damages, losses, or liabilities arising out of or related to such termination."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Client Termination: Clients may terminate their QAComet subscription with 30 days advance written notice at any time by emailing "},{"type":"element","tag":"a","props":{"href":"mailto:contact@qacomet.com"},"children":[{"type":"text","value":"contact@qacomet.com"}]},{"type":"text","value":"."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Survival: Sections of these Terms including Confidentiality, Indemnification, Limitation of Liability, and those related to QAComet ownership rights shall survive any termination expiration of these Terms of Service."}]},{"type":"element","tag":"h2","props":{"id":"_15-severability"},"children":[{"type":"text","value":"15. SEVERABILITY"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Summary: "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"This clause provides assurance to QAComet and its clients that the validity and enforceability of the Terms will be preserved to the fullest extent possible"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In the event that any provision of these Terms of Service is determined to be unlawful, void, or unenforceable by a court of competent jurisdiction, such provision shall be deemed severable from these Terms and shall not affect the validity and enforceability of any remaining provisions."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The parties agree that the court shall have the authority to modify or replace any provision of these Terms that is determined to be unlawful, void, or unenforceable with a valid and enforceable provision that most closely reflects the intent of the original provision."}]},{"type":"element","tag":"h2","props":{"id":"_16-contact-us"},"children":[{"type":"text","value":"16. Contact Us:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For any inquiries, questions, or assistance regarding QAComet services or these Terms of Service, please feel free to contact us at "},{"type":"element","tag":"a","props":{"href":"mailto:contact@qacomet.com"},"children":[{"type":"text","value":"contact@qacomet.com"}]},{"type":"text","value":". We welcome your feedback and are committed to providing prompt and helpful assistance to our clients."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"definitions","depth":2,"text":"Definitions:"},{"id":"_2-scope-of-service","depth":2,"text":"2. SCOPE OF SERVICE"},{"id":"_3-account-security","depth":2,"text":"3. ACCOUNT SECURITY"},{"id":"_4-right-to-refuse-or-cancel-services","depth":2,"text":"4. RIGHT TO REFUSE OR CANCEL SERVICES"},{"id":"_5-promotional-rights","depth":2,"text":"5. PROMOTIONAL RIGHTS:"},{"id":"_6-ownership-of-materials","depth":2,"text":"6. OWNERSHIP OF MATERIALS:"},{"id":"_7-client-responsibilities","depth":2,"text":"7. CLIENT RESPONSIBILITIES:"},{"id":"_8-billing-and-payments","depth":2,"text":"8. BILLING AND PAYMENTS:"},{"id":"_9-intellectual-property-rights","depth":2,"text":"9. INTELLECTUAL PROPERTY RIGHTS:"},{"id":"_10-qacomet-pre-existing-ip-materials","depth":2,"text":"10. QACOMET Pre-Existing IP MATERIALS."},{"id":"_11-limitation-of-liability-and-disclaimer-of-warranties","depth":2,"text":"11. LIMITATION OF LIABILITY AND DISCLAIMER OF WARRANTIES:"},{"id":"_12-confidentiality","depth":2,"text":"12. CONFIDENTIALITY:"},{"id":"_13-dispute-resolution-and-governing-law","depth":2,"text":"13. DISPUTE RESOLUTION AND GOVERNING LAW:"},{"id":"_14-modification-and-termination","depth":2,"text":"14. MODIFICATION AND TERMINATION:"},{"id":"_15-severability","depth":2,"text":"15. SEVERABILITY"},{"id":"_16-contact-us","depth":2,"text":"16. Contact Us:"}]}},"_type":"markdown","_id":"content:terms-of-service.md","_source":"content","_file":"terms-of-service.md","_extension":"md"}],"navigation":[{"title":"Case Studies","_path":"/case-studies","children":[{"title":"Automatisch","_path":"/case-studies/automatisch"}]},{"title":"Privacy Policy","_path":"/privacy-policy"},{"title":"Terms And Conditions","_path":"/terms-and-conditions"},{"title":"Terms Of Service","_path":"/terms-of-service"}]}