[{"data":1,"prerenderedAt":307},["ShallowReactive",2],{"blog-post-/blog/qa-for-early-stage-startups":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":7,"subtitle":9,"breadcrumbs":10,"link":15,"created":16,"shortDescription":21,"body":22,"_type":302,"_id":303,"_source":304,"_file":305,"_extension":306},"/blog/qa-for-early-stage-startups","blog",false,"","QA for early stage startups","Practical advice for getting started with QA for early stage startups.",[11,14],{"name":12,"path":13},"Blog","/blog/",{"name":8,"path":15},"/blog/qa-for-early-stage-startups/",{"string":17,"month":18,"day":19,"year":20},"June 22, 2024","Jun",22,2024,"Practical advice for getting started with QA for early stage startups. Whether you've just found product market fit, or are thinking about improving your product's usability, this guide is a must for any founder.",{"type":23,"children":24,"toc":292},"root",[25,34,51,56,76,81,87,102,107,112,117,122,126,133,145,153,158,171,176,182,194,199,222,227,233],{"type":26,"tag":27,"props":28,"children":30},"element","h2",{"id":29},"introduction",[31],{"type":32,"value":33},"text","Introduction",{"type":26,"tag":35,"props":36,"children":37},"p",{},[38,40,49],{"type":32,"value":39},"One common question we received from our ",{"type":26,"tag":41,"props":42,"children":46},"a",{"href":43,"rel":44},"https://qacomet.com/white-papers/how-qa-factors-into-vc-due-diligence/",[45],"nofollow",[47],{"type":32,"value":48},"QA in in VC investment analysis report",{"type":32,"value":50}," was how should early stage startups should be thinking about QA while developing their product. Thinking on this, and applying the advice we learned from the research survey, we've come up with some general guidelines to help you get started.",{"type":26,"tag":35,"props":52,"children":53},{},[54],{"type":32,"value":55},"The main challenge with this question is the response is vertical specific; but, there's still advice applicable in each case. The main partition is between startups who are deep-tech or have legal risks, and startups with customers more tolerant of failure. It's imperative to know where you sit on this divide, and there are some general questions you can ask to help figure it out. These include:",{"type":26,"tag":57,"props":58,"children":59},"ul",{},[60,66,71],{"type":26,"tag":61,"props":62,"children":63},"li",{},[64],{"type":32,"value":65},"How tolerant are my customers of my product failing?",{"type":26,"tag":61,"props":67,"children":68},{},[69],{"type":32,"value":70},"If my product breaks, are there any competitors who can scoop up these customers?",{"type":26,"tag":61,"props":72,"children":73},{},[74],{"type":32,"value":75},"Will bugs create financial pain, or can customers wait until a fix to finish their workflow?",{"type":26,"tag":35,"props":77,"children":78},{},[79],{"type":32,"value":80},"Regardless of where you fit, it's still a challenge figuring out where QA integrates into your product development pipeline. It's your job as a founder to move fast, find product market fit (PMF), and build a unique product around core customer pain point(s). Once you have PMF, you're now focusing more on building and releasing features.",{"type":26,"tag":27,"props":82,"children":84},{"id":83},"qa-advice-for-every-early-stage-startup",[85],{"type":32,"value":86},"QA advice for every early stage startup",{"type":26,"tag":88,"props":89,"children":90},"blockquote",{},[91],{"type":26,"tag":35,"props":92,"children":93},{},[94,96],{"type":32,"value":95},"Word-of-mouth recommendations carry the highest weight, with 73% of buyers ranking it first. - ",{"type":26,"tag":41,"props":97,"children":99},{"href":98},"#references",[100],{"type":32,"value":101},"Wynter",{"type":26,"tag":35,"props":103,"children":104},{},[105],{"type":32,"value":106},"There's some QA which every early stage startup can benefit from, but it's best to know what constraints you face to get the best possible mileage out of this kind of work. At this point you've found customer pain points and have built some kind of MVP to solve their problem, but it's a good idea to dive deeper into what expectations customers have for your product.",{"type":26,"tag":35,"props":108,"children":109},{},[110],{"type":32,"value":111},"These expectations set the constraints for how much time you need to invest in testing before releasing new features. Some constraints to consider are understanding your customer's technical abilities, their patience with new tech, tolerance for bugs or broken workflows, ability to handle product changes, or even their external constraints. You may be building products used by workers at 3 AM in the morning. If they didn't get the sleep they needed before their night shift it's your obligation to make sure they can't easily fail while using your product. Finding these constraints is essential for understanding who you're building your product for. Without this you can be blindsided by mistakes which can cause unneeded churn.",{"type":26,"tag":35,"props":113,"children":114},{},[115],{"type":32,"value":116},"Once you have an idea of your customers, their challenges, and their constraints, you can start thinking about the usability of your product. For every early stage startup usability is key to building a successful product. Without great usability you'll be confusing your customers, spending more time on support tickets, and can expect more sluggish growth.",{"type":26,"tag":35,"props":118,"children":119},{},[120],{"type":32,"value":121},"Now, having a QA in the UX design phase accelerates you towards a well-crafted product that customers love. This is because QA is helpful during these early points for noticing workflow quirks before your customers find them. In addition, this adversarial mindset is helpful for further refining workflows. Any extra page or click you can shave off a workflow has tremendous benefits. Not only will customers experience less friction using your product, but now you will have less complexity to deal with. This can reduce bug-surface area and lead to faster development time. Having better usability leads to better workflows, happier customers, and more referrals for growing your customer base.",{"type":26,"tag":123,"props":124,"children":125},"order-usability-report",{},[],{"type":26,"tag":127,"props":128,"children":130},"h3",{"id":129},"measuring-your-performance",[131],{"type":32,"value":132},"Measuring your performance",{"type":26,"tag":35,"props":134,"children":135},{},[136,138,143],{"type":32,"value":137},"One of the most common ways to measure your product's performance amongst customers is to measure your Net Promotor Score (NPS) ",{"type":26,"tag":41,"props":139,"children":140},{"href":98},[141],{"type":32,"value":142},"[Nielsen Norman]",{"type":32,"value":144},". Calculating this starts by surveying customers to rate on a 0-10 scale how likely they will recommend your product to a friend or their company. Then you take their ratings and put them into two buckets. The first are the number of promoters and the second are the number of detractors. A promoter is someone who rates 9 or 10, and a detractor is someone who rates their likelihood somewhere in 0-6. You then calculate NPS with the following formula:",{"type":26,"tag":88,"props":146,"children":147},{},[148],{"type":26,"tag":35,"props":149,"children":150},{},[151],{"type":32,"value":152},"NPS = %promoters - %detractors",{"type":26,"tag":35,"props":154,"children":155},{},[156],{"type":32,"value":157},"What this measures is not only the percentage of customers who are true believers, but it's weighted down by those who don't like it. If %40 of customers are true believers, and %40 are detractors, you'll have an NPS of 0. This translates to a lot of mixed signals to folks within your market who may become customers. With so many detractors, you're more likely to receive poor reviews on software ratings tools, such as G2. This is bad because reviews are used by 98% of buyers before purchasing software.",{"type":26,"tag":88,"props":159,"children":160},{},[161],{"type":26,"tag":35,"props":162,"children":163},{},[164,166],{"type":32,"value":165},"In fact, reading reviews before making a purchase decision is important for 98% of buyers. - ",{"type":26,"tag":41,"props":167,"children":168},{"href":98},[169],{"type":32,"value":170},"Gartner",{"type":26,"tag":35,"props":172,"children":173},{},[174],{"type":32,"value":175},"Now, if 40% of customers are true believers, and only 10% are detractors, then you're doing pretty well since most are neutral or love your product. This leaves an opportunity to convert those more apathetic customers into true believers. Additionally, you should find out from your investors, or conduct market research yourself on what the NPS is for startups in your market. This will give you a better idea of how well you are performing within your market.",{"type":26,"tag":27,"props":177,"children":179},{"id":178},"qa-for-early-stage-technical-startups",[180],{"type":32,"value":181},"QA for early stage technical startups",{"type":26,"tag":88,"props":183,"children":184},{},[185],{"type":26,"tag":35,"props":186,"children":187},{},[188,190],{"type":32,"value":189},"48% of customers see security as a key factor they consider during their software search. - ",{"type":26,"tag":41,"props":191,"children":192},{"href":98},[193],{"type":32,"value":170},{"type":26,"tag":35,"props":195,"children":196},{},[197],{"type":32,"value":198},"Now if you're an early stage startup that has more technical requirements, has legal risks from managing PII, or have finicky customers who want a perfect product, you're now playing an additional ball-game to ensure your customers are safe and happy. With products like these you should be following best software practices ensuring your product is being rigorously tested every time you make a feature change or update. This includes",{"type":26,"tag":57,"props":200,"children":201},{},[202,207,212,217],{"type":26,"tag":61,"props":203,"children":204},{},[205],{"type":32,"value":206},"Integrating Continuous Integration (CI) into your Software Development LifeCycle (SDLC).",{"type":26,"tag":61,"props":208,"children":209},{},[210],{"type":32,"value":211},"Using test automation with broad coverage ensuring core workflows are functioning correctly.",{"type":26,"tag":61,"props":213,"children":214},{},[215],{"type":32,"value":216},"Automating adversarial tests ensuring your security is tight.",{"type":26,"tag":61,"props":218,"children":219},{},[220],{"type":32,"value":221},"Using QA at each phase of product development cycle.",{"type":26,"tag":35,"props":223,"children":224},{},[225],{"type":32,"value":226},"For the last point this means having someone QA during the design phase, QA should be looking for bugs and other problems while developing features and committing code, and finally having a final pass-through before releasing to production whenever you need the additional level of safety. Having these layers of both automated and manual checks helps ensure the software your releasing is safe for your customers.",{"type":26,"tag":27,"props":228,"children":230},{"id":229},"references",[231],{"type":32,"value":232},"References",{"type":26,"tag":57,"props":234,"children":235},{},[236,250,264,278],{"type":26,"tag":61,"props":237,"children":238},{},[239,241,248],{"type":32,"value":240},"[AgilityPR] ",{"type":26,"tag":41,"props":242,"children":245},{"href":243,"rel":244},"https://www.agilitypr.com/pr-news/uncategorized/what-influences-b2b-tech-purchase-decisions-new-study-reveals-rise-of-expert-peers-and-word-of-mouth-as-primary-drivers/",[45],[246],{"type":32,"value":247},"Peer recommendations and word of mouth drive consumers to purchase B2B technology",{"type":32,"value":249},". AgilityPR.",{"type":26,"tag":61,"props":251,"children":252},{},[253,255,262],{"type":32,"value":254},"[Gartner] ",{"type":26,"tag":41,"props":256,"children":259},{"href":257,"rel":258},"https://www.gartner.com/en/digital-markets/insights/2024-global-software-buying-trends",[45],[260],{"type":32,"value":261},"2024 Global Software Buying Trends Report",{"type":32,"value":263},". Gartner.",{"type":26,"tag":61,"props":265,"children":266},{},[267,269,276],{"type":32,"value":268},"[Nielsen Norman] ",{"type":26,"tag":41,"props":270,"children":273},{"href":271,"rel":272},"https://www.nngroup.com/articles/nps-ux/",[45],[274],{"type":32,"value":275},"Net Promoter Score: What a Customer-Relations Metric Can Tell You About Your User Experience",{"type":32,"value":277},". Nielsen Norman Group.",{"type":26,"tag":61,"props":279,"children":280},{},[281,283,290],{"type":32,"value":282},"[Wynter] ",{"type":26,"tag":41,"props":284,"children":287},{"href":285,"rel":286},"https://wynter.com/post/how-b2b-saas-marketing-leaders-buy-2024",[45],[288],{"type":32,"value":289},"The B2B Buyer Journey Research: How B2B SaaS Marketing Leaders Buy Software in 2024",{"type":32,"value":291},". Wynter.",{"title":7,"searchDepth":293,"depth":293,"links":294},2,[295,296,300,301],{"id":29,"depth":293,"text":33},{"id":83,"depth":293,"text":86,"children":297},[298],{"id":129,"depth":299,"text":132},3,{"id":178,"depth":293,"text":181},{"id":229,"depth":293,"text":232},"markdown","content:blog:qa-for-early-stage-startups.md","content","blog/qa-for-early-stage-startups.md","md",1719284776934]